-- Localization for Russian Clients.
if GetLocale() ~= "ruRU" then return; end
local app = select(2, ...);
local L = app.L;

-- WoW API Cache
local GetSpellName = app.WOWAPI.GetSpellName;

-- General Text
	L.DESCRIPTION = "\"Глупцы! Вы сами нашли свою погибель! Вам никогда не понять, сколь велика сила, потревоженная вами.  Вы сражались отчаянно, чтобы проникнуть в царство Жнеца. Теперь перед вами лежит лишь один путь – путь проклятых.\"";
	L.THINGS_UNTIL = " ШТУЧЕК ДО ";
	L.THING_UNTIL = " ШТУЧКА ДО ";
	L.YOU_DID_IT = "ВЫ СДЕЛАЛИ ЭТО!";

-- Big new chunk from AllTheThings.lua
	L.PROGRESS = "Прогресс";
	L.TRACKING_PROGRESS = "Отслеживание выполнения";
	L.COLLECTED_STRING = " Собрано";
	L.PROVIDERS = "Начинает";
	L.COLLECTION_PROGRESS = "Прогресс Коллекции";
	L.CONTAINS = "Содержит:";
	L.FACTIONS = "Фракции";
	L.COORDINATES = "Координаты";
	L.AND_MORE = "И ещё %s...";
	L.AND_OTHER_SOURCES = "И %s других источников...";
	L.PLAYER_COORDINATES = "Ваши Координаты";
	L.NO_COORDINATES_FORMAT = "Нет координат для %s";
	L.TOM_TOM_NOT_FOUND = "Нужен TomTom, чтобы ставить Указатели.";
	L.FLIGHT_PATHS = "Пути Полётов";
	L.KNOWN_BY = "Изучено на %s";
	L.REQUIRES = "Требуется";
	L.RACE_LOCKED = "Ограничено Расой";
	L.PLEASE_REPORT_MESSAGE = "Пожалуйста, сообщите об этом на Discord-сервере ATT в канале #retail-errors! Спасибо!";
	L.REPORT_TIP = "\n("..CTRL_KEY_TEXT.."+C, чтобы скопировать многострочный отчёт в буфер обмена)";
	L.NOT_AVAILABLE_IN_PL = "Недоступно в Персональной добыче.";
	L.MARKS_OF_HONOR_DESC = "Почётные знаки должны быть рассмотрены во всплывающем окне, чтобы видеть всё их 'Содержимое'.\n(Введите '/att' в чат и затем "..SHIFT_KEY_TEXT.." клик для ссылки на предмет)\n\n|cFFfe040fПосле покупки и использования Набора может потребоваться полностью выйти из игры и вручную обновить коллекцию (в таком порядке),\nчтобы корректно зарегистрировать все предметы.|r";
	--TODO: L.MOP_REMIX_BRONZE_DESC = "Bronze must be viewed in a Popout window to see all of the normal 'Contains' content.\n(Type '/att ' in chat then "..SHIFT_KEY_TEXT.." click to link the currency)\n\n|cFFfe040fAfter purchasing and using an ensemble, relogging & a forced ATT refresh (in this order)\nmay be required to register all the items correctly.|r";
	L.ITEM_GIVES_REP = "Улучшает Репутацию с '";
	L.COST = "Стоимость";
	L.COST_DESC = "Содержит визуальную справку о предметах, необходимых для покупки или получения данной Штучки";
	L.COST_TOTAL = "Полная Стоимость";
	L.COST_TOTAL_DESC = "Содержит визуальную справку о предметах, необходимых для покупки или получения всех Штучек в группе.\n\nЗаметка: На данный момент без учёта Реагентов/Рецептов!";
	L.SOURCES = "Источник(и)";
	L.SOURCES_DESC = "Показывает Источник этой Штучки.\n\nВ частности, конкретный торговец/НИП, Задание, Событие и т.д.";
	L.WRONG_FACTION = "Вы должны быть за другую фракцию, чтобы видеть это.";
	L.ARTIFACT_INTRO_REWARD = "Выдаётся в награду за выполнение вводного задания для данного Артефакта.";
	L.VISIT_FLIGHT_MASTER = "Посетите Распорядителя Полётов для добавления в кэш.";
	L.FLIGHT_PATHS_DESC = "Пути Полётов засчитываются, когда Вы говорите с Распорядителем Полётов на каждом континенте.\n  - Crieve";
	L.FOLLOWERS_COLLECTION_DESC = "Спутники могут быть собраны на Весь Аккаунт, если включена соответствующая опция.\n\nВы должны вручную обновить коллекцию через "..SHIFT_KEY_TEXT.." клик по заголовку, чтобы они засчитались.";
	L.HEIRLOOM_TEXT = "Разблокированное Наследство";
	L.HEIRLOOM_TEXT_DESC = "Показывает, получено или нет данное наследство.";
	L.FAILED_ITEM_INFO = "Не удалось получить информацию о предмете. Предмет может быть неправильный или ещё не был кэширован на Вашем сервере.";
	L.HEIRLOOMS_UPGRADES_DESC = "Показывает, улучшили ли Вы наследство до определённого уровня или нет.\n\nПокойся с миром, Золото.\n - Crieve";
	L.MUSIC_ROLLS_DESC = "Эти Штучки открываются на каждом персонаже отдельно и на данный момент не распределяются на Вашу учётную запись. Если кто-нибудь из Blizzard читает это, будет просто шикарно, если Вы сделаете их на весь аккаунт.\n\nВы должны вручную обновить коллекцию через "..SHIFT_KEY_TEXT.." клик по заголовку, чтобы засчитать эту Штучку.";
	L.MUSIC_ROLLS_DESC_2 = "\n\nСначала нужно разблокировать Мелодии, выполнив задание \"Врубай басы\" в Вашем гарнизоне, чтобы данный предмет мог выпасть.\n\nДля фильтров нужно иметь Камеру СЕЛФИ 2.0.";
	L.OPPOSITE_FACTION_EQ = "Эквивалент противоположной фракции: ";
	L.SELFIE_DESC = "Сделайте селфи, используя вашу ";
	L.SELFIE_DESC_2 = " с |cffff8000";
	L.EXPANSION_DATA[1].name = "Classic";
	L.EXPANSION_DATA[1].lore = "Полный решимости заселить засушливые земли Дуротара, Тралл позволил Отрекшимся присоединиться к Орде, состоявшей из орков, тауренов и троллей. В то же время дворфы, гномы и древние ночные эльфы присягнули Альянсу, управляемому королевством людей. После таинственного исчезновения короля Штормграда Вариана Ринна, регентом был назначен Верховный лорд Болвар Фордрагон, но истинная власть находилась в руках черного дракона Ониксии, скрывавшейся под личиной дворянки и подчинившей Фордрагона своей воле. По мере того как герои узнавали новые подробности страшного заговора, во всех концах мира пробуждались древние силы, представлявшие угрозу как для Альянса, так и для Орды.";
	L.EXPANSION_DATA[2].lore = "Владыка Судеб Каззак вновь открыл Темный портал в Запределье, из которого в Азерот хлынули кровожадные демоны Пылающего Легиона. Эльфы крови и дренеи присоединились к экспедиционным силам Альянса и Орды, которые отправились через портал в самое сердце Запределья, чтобы нанести поражение демонам прямо в их логове. На испепеленном Полуострове Адского Пламени в Запределье герои Альянса обнаружили нескольких своих соплеменников, которые давным-давно прошли через портал. В это же время воины Орды встретились с «неоскверненными» орками из племени Маг'хар, которые не участвовали во вторжении на Азерот. В ходе кампании в Запределье союзные войска все больше увязали в конфликте с Легионом и подручными Иллидана Ярости Бури, который распространил свое влияние на все уголки разрушенного мира.";
	L.EXPANSION_DATA[3].lore = "Когда Солнечный Колодец был очищен от скверны, в мире наступило спокойствие, причем настолько безмятежное, что просто не могло не вызвать подозрений. Внезапно, как по сигналу, войска Плети приступили к планомерному нападению на города по всему Азероту уже и за пределами Восточных Королевств. Вождь Тралл был вынужден принять решительные меры и направил в Нордскол экспедиционный корпус под началом Гарроша Адского Крика. Тем временем в Штормград, наконец, вернулся король людей Вариан Ринн и занял свое законное место на престоле. На бой с Королем-личом он выставил внушительное войско Альянса под командованием Болвара Фордрагона. Кроме того, воины Альянса должны были подавить любое сопротивление Орды.";
	L.EXPANSION_DATA[4].lore = "Экспедиции в Нордскол вернулись с победой, но внезапно на Азерот обрушились разгневанные элементали — знак, что грядет возвращение аспекта драконов Смертокрыла Разрушителя. Он покинул свое логово и принес в Азерот разрушение, открыв проходы в Царство Стихий, через которые хлынули беснующиеся элементали и их владыки. Они намерены помочь Смертокрылу и отвратительному культу Сумеречного Молота приблизить Время Сумерек и уничтожить все живое в Азероте.";
	L.EXPANSION_DATA[5].lore = "От Смертокрыла мир удалось спасти, и вождь Гаррош Адский Крик решил: когда, как не теперь, нанести удар по Альянсу и расширить владения Орды в Калимдоре. Под натиском его армии пал и был разрушен до основания город людей Терамор. По всему миру противостояние между фракциями разгорелось с новой силой. После крупного морского сражения остатки флота Орды и Альянса прибило к туманным берегам Пандарии — таинственного континента, не отмеченного ни на одной карте. На берегу этой богатой земли враждующие фракции встретили благородных пандаренов — один из главных местных народов. Пандарены вступили в союз с Альянсом и Ордой, надеясь с их помощью изгнать со своих земель злобных ша — бестелесных созданий, явившихся на свет из недр Пандарии в давней кровопролитной войне.";
	L.EXPANSION_DATA[6].lore = "Гаррош Адский Крик бежал от правосудия, в чем ему помог бронзовый дракон Кайроздорму. Бывшему вождю удалось вернуться назад во времени и попасть на Дренор еще до вторжения Орды в Азерот. Поддавшись жажде мести, Гаррош выдал своему отцу, Громмашу Адскому Крику, все технологии для создания идеальной армии для завоевания других миров — Железной Орды. Громмаш объединил все разрозненные кланы орков Дренора под своим знаменем, сделав их вождей своими военачальниками. В число приближенных вошли кровожадный Каргат Острорук, хитрый Чернорук, старый шаман Нер'зул и бесстрашный Килрогг Мертвый Глаз. Железная Орда захватила ряд ключевых областей Дренора, покорила город огров из клана Верховного Молота и построила крупные военные объекты вроде литейной клана Черной горы, снабжающей армии Орды оружием. Завладев Дренором, орки Железной Орды вторглись в Азерот через Темный портал, разорили крепость Стражей Пустоты и захватили форт Молота Ужаса. В ответ на нападение верховный маг Кадгар призвал на помощь героев Альянса и Орды и повел их через портал на Дренор, чтобы остановить Железную Орду раз и навсегда. В итоге Гаррош пал от руки Тралла, а героям Азерота удалось в ходе продолжительной и тяжелой кампании уничтожить большую часть военачальников Железной Орды. Возглавляемое Кадгаром наступление позволило нанести сокрушительный удар Железной Орде. Громмаш не смог привести своих воинов к обещанной победе, и в рядах его последователей назрел раскол. Это позволило чернокнижнику Гул'дану захватить власть в Железной Орде и призвать на Дренор демонов Пылающего Легиона...";
	L.EXPANSION_DATA[7].lore = "После битвы за Дренор коварный Гул'дан очутился в Азероте. Под влиянием демонического владыки Кил'джедена Искусителя он открыл гробницу Саргераса, а вместе с ней — врата, через которые Пылающий Легион вторгся в Азерот. Чернокнижник покорил Расколотые острова, включая древний город ночнорожденных Сурамар, и подчинил своей воле их лидера, Великого магистра Элисанду. Альянс и Орда штурмовали Расколотый берег в надежде остановить Гул'дана и предотвратить вторжение Легиона, но их усилия оказались тщетны и стоили жизни королю Вариану Ринну и вождю Вол'джину. Тогда верховный маг Кадгар предпринял отчаянную попытку объединить раздробленные фракции, что привело к восстановлению Столпов Созидания — единственного инструмента, способного вновь запечатать гробницу. Жители Расколотых островов освободились от влияния Легиона, а силы Альянса и Орды приблизились к базе Гул'дана, Цитадели Ночи, в надежде раз и навсегда положить конец зловещим амбициям чернокнижника...";
	L.EXPANSION_DATA[8].lore = "Когда Саргерас нанес Азерот страшную рану, из недр планеты поднялась нестабильная субстанция, прозванная азеритом — кровь самого спящего титана. Вскоре Альянс и Орда поняли, какой потенциал сокрыт в этом веществе, и взаимная неприязнь перешла в открытую конфронтацию. В стремлении завладеть как можно большим количеством азерита, Орда сожгла Тельдрассил, а затем Альянс осадил Подгород.\n\nОбе фракции были ослаблены и нуждались в новых союзниках и в героях, которые бы помогли их найти. Так Джайна Праудмур отправилась на свою родину, Кул-Тирас, в надежде уговорить морскую державу вновь присоединиться к Альянсу. Однако местные дворянские дома погрязли в конфликтах и проявили единодушие лишь в ненависти к Джайне за ее прошлые поступки. В то же время герои Орды вызволили зандаларскую принцессу Таланджи из тюрьмы Штормграда. И, хотя сперва ее отец, король Растахан, не был настроен слушать послов, со временем Таланджи все-таки уговорила зандаларских троллей присоединиться к Орде. Дипломатия помогла обеим фракциям, и в результате успешных военных кампаний они основали надежные базы в Зандаларе и Кул-Тирасе.\n\nДобившись доверия со стороны своих новых союзников, Альянс и Орда вновь скрестили клинки, не замечая, что над ними нависли грозные волны возмездия…";
	L.EXPANSION_DATA[9].lore = "Одним отчаянным ударом Сильвана Ветрокрылая разрушила границу между миром живых и загробным царством. Храбрейших защитников Азерота затянула всепожирающая тьма. Несущая смерть древняя сила грозит сбросить оковы и уничтожить саму реальность.\n\nТех, кто осмелится сделать шаг в царство мертвых, ждут чудесные и пугающие неизведанные миры. Темные земли — это царство, в котором обитают души умерших. Это мир между мирами, от хрупкого баланса в котором зависит само существование жизни и смерти.\n\nКак одного из величайших защитников Азерота, вас наделили способностью пребывать в этом мире, не теряя своей телесной оболочки. Теперь вам предстоит раскрыть заговор, грозящий уничтожением Вселенной, и помочь легендарным героям всех эпох Warcraft вернуться в Азерот... или окончательно покинуть этот мир.";
	L.EXPANSION_DATA[10].lore = "Драконы Азерота откликнулись на зов и вернулись, чтобы защитить свою родину, Драконьи острова. Магия стихий и энергия жизни Азерота наполняют вновь пробудившиеся Драконьи острова, и теперь вам предстоит исследовать их первобытные чудеса и раскрыть давно забытые тайны.";
	--TODO: L.EXPANSION_DATA[11].lore = "The War Within is the tenth expansion for World of Warcraft and the beginning of the Worldsoul Saga. Journey through never-before-seen subterranean worlds filled with hidden wonders and lurking perils, down to the dark depths of the nerubian empire, where the malicious Harbinger of the Void is gathering arachnid forces to bring Azeroth to its knees.";
	--TODO: L.EXPANSION_DATA[12].lore = "Midnight is the eleventh expansion for World of Warcraft and the second installment of the Worldsoul Saga.";
	--TODO: L.EXPANSION_DATA[13].lore = "The Last Titan is the twelfth expansion for World of Warcraft and the final installment of the Worldsoul Saga.";
	L.TITLES_DESC = "Звания отслеживаются по всей учётной записи, однако, некоторые Ваши персонажи могут иметь звания, доступные только им.";
	L.UPON_COMPLETION = "По выполнении";
	L.UPON_COMPLETION_DESC = "Задания выше должны быть выполнены прежде, чем Вы сможете выполнить штучки, указанные ниже.";
	L.QUEST_CHAIN_REQ = "Требования для Цепочки Заданий";
	L.QUEST_CHAIN_REQ_DESC = "Следующие задания должны быть выполнены прежде, чем Вы сможете выполнить финальное задание.";
	L.AH_SEARCH_NO_ITEMS_FOUND = "Не найдено кэшированных предметов в поиске. Расширьте группу и осмотрите предметы для кэширования имен, и попробуйте снова. Только Персональные при Надевании предметы будут найдены при использовании данного поиска.";
	L.AH_SEARCH_BOE_ONLY = "Только Персональные при Надевании предметы будут найдены при использовании данного поиска.";
	L.TSM_WARNING_1 = "Использование данной команды может сломать Ваши существующие настройки TSM при перераспределении предметов к ";
	L.TSM_WARNING_2 = " группе.\n\nМы рекомендуем, чтобы Вы использовали другой профиль для данной функции.\n\nХотите продолжить в любом случае?";
	L.PRESET_UPDATE_SUCCESS = "Группа обновлена успешно.";
	L.SHOPPING_OP_MISSING_1 = "Группе не назначена операция 'Закупки'.";
	L.SHOPPING_OP_MISSING_2 = "Введине '/tsm operations', чтобы создать или назначить оную.";
	L.AUCTIONATOR_GROUPS = "Поиск по группам доступен только при использовании Auctionator.";
	L.TSM4_ERROR = "TSM4 пока что не совместим с ATT. Если Вы знаете, как создавать Группы, как мы делали это в TSM3, пожалуйста, свяжитесь с Crieve в Дискорде!";
	L.QUEST_MAY_BE_REMOVED = "Ошибка при получении информации. Это задание, возможно, удалено из игры. ";


	L.FACTION_SPECIFIC_REP = "Не все репутации видны одному персонажу. Например, Всадники Песни Войны не видны Игрокам Альянса, а Среброкрылые Часовые - Игрокам Орды.";
	L.MINUMUM_STANDING_WITH_FACTION = "Требуется отношение не менее, чем %s с %s.";
	L.MAXIMUM_STANDING_WITH_FACTION = "Требуется отношение менее, чем %s с %s.";
	L.MIN_MAX_STANDING_WITH_FACTION = "Требуется отношение между %s и %s с %s.";

	L.ADDED_WITH_PATCH = "Добавлено в патче";
	L.REMOVED_WITH_PATCH = "Убрано в патче";
	--TODO: L.ALIVE = "Alive";
	--TODO: L.SPAWNED = "Spawned";
	L.OBJECT_TYPE = "Тип Объекта";
	L.OBJECTIVES = "Цели";
	L.QUEST_GIVERS = "Квестодатели";
	L.DURING_WQ_ONLY = "Может быть выполнено, когда локальное задание активно.";
	L.COMPLETED_DAILY = "Может быть выполнено ежедневно.";
	L.COMPLETED_WEEKLY = "Может быть выполнено еженедельно.";
	L.COMPLETED_MONTHLY = "Может быть выполнено ежемесячно.";
	L.COMPLETED_YEARLY = "Может быть выполнено ежегодно.";
	L.COMPLETED_MULTIPLE = "Может быть выполнено несколько раз.";
	L.CRITERIA_FOR = "Критерий для";
	L.CURRENCY_FOR = "Валюта для";
	L.LOOT_TABLE_CHANCE = "Общий шанс получения";
	L.BEST_BONUS_ROLL_CHANCE = "Наилучший шанс бонусного броска";
	L.BEST_PERSONAL_LOOT_CHANCE = "Наилучший шанс Персональной добычи";
	L.PREREQUISITE_QUESTS = "Есть предшествующие задания, которые должны быть выполнены перед получением:";
	L.BREADCRUMBS = "Задания-\"хлебные крохи\"";
	L.BREADCRUMBS_WARNING = "Есть задания-\"хлебные крохи\", которые могут быть недоступны после выполнения:";
	L.THIS_IS_BREADCRUMB = "Это задание-\"хлебная кроха\".";
	L.BREADCRUMB_PARTYSYNC = "Может быть недоступно для выполнения без Синхронизации группы, если выполнить любое из этих заданий:";
	L.BREADCRUMB_PARTYSYNC_2 = "Есть шанс получить при помощи Синхронизации группы с другим персонажем, который не выполнил ни одно из этих заданий:";
	L.BREADCRUMB_PARTYSYNC_3 = "Есть шанс получить при помощи Синхронизации группы с персонажем, который может принять это задание.";
	L.BREADCRUMB_PARTYSYNC_4 = "Пожалуйста, расскажите на нашем сервере Discord, смогли ли Вы получить это Задание при помощи Синхронизации группы!";
	L.DISABLE_PARTYSYNC = "Скорее всего это Задание невозможно выполнить на данном персонаже даже с Синхронизацией группы. Если Вам всё же удастся, пожалуйста, сообщите нам в Discord!";
	L.UNAVAILABLE_WARNING_FORMAT = "Становится недоступным, если %d из следующих выполнены:";
	L.NO_ENTRIES = "Не найдено ничего, что бы соответствовало вашим фильтрам.";
	L.NO_ENTRIES_DESC = "Если Вы уверены, что это была ошибка, попробуйте включить 'Режим Отладки'. Один из Ваших фильтов может ограничивать видимость группы.";
	L.DEBUG_LOGIN = "Награда за вход в игру.\n\nОтличная работа! ВЫ СДЕЛАЛИ ЭТО!\n\nОтображается только в Режиме Отладки.";
	L.UNSORTED = "Несортированные";
	L.UNSORTED_DESC = "Эта Штучка ещё не была добавлена в ATT " .. app.Version .. ".";
	L.NEVER_IMPLEMENTED = "Никогда Не Добавлены";
	L.NEVER_IMPLEMENTED_DESC = "Предметы технически существуют в игре, но никогда не были доступны игрокам";
	L.HIDDEN_QUEST_TRIGGERS = "Скрытые Триггеры Заданий";
	L.HIDDEN_QUEST_TRIGGERS_DESC = "Эти Задания, которые срабатывают основываясь на определённых критериях, в основном используются внутри игры в целях отслеживания";
	L.UNSORTED_DESC_2 = "Эти предметы существуют в игре и могут быть доступны игрокам, но ещё не были отсортированы в корректную секцию в ATT";
	L.OPEN_AUTOMATICALLY = "Открывается автоматически";
	L.OPEN_AUTOMATICALLY_DESC = "Если Вы не разработчик Blizzard, то может быть хорошей идей отключить эту функцию. Это было сделано для того, чтобы заставить Blizzard исправить и/или признать данные баги.";
	L.MINI_LIST = "Мини Список";
	L.MINI_LIST_DESC = "Этот список содержит важную информацию для текущей зоны, которая не может быть найдена в базе данных ATT";
	L.UPDATE_LOCATION_NOW = "Обновить Зону Сейчас";
	L.UPDATE_LOCATION_NOW_DESC = "Если Вы хотите принудительно обновить данные Вашей текущей Карты, нажмите эту кнопку!";
	L.PERSONAL_LOOT_DESC = "Каждый игрок имеет независимый шанс получить предмет, полезный для его класса...\n\n... Или хлам типа колец.\n\nКликните дважды, чтобы создать группу автоматически, если Вы сами по себе.";
	L.RAID_ASSISTANT = "Рейдовый Помощник";
	L.RAID_ASSISTANT_DESC = "Больше никогда не заходите в подземелье с неправильными настройками! Проверяйте, всё ли так, как нужно!";
	L.LOOT_SPEC_UNKNOWN = "Неизвестная Специализация для добычи";
	L.LOOT_SPEC = "Специализация для добычи";
	L.LOOT_SPEC_DESC = "В подземельях, рейдах и событиях в открытом мире с Персональной добычей, данная опция будет диктовать, какие предметы Вам доступны.\n\nНажмите эту строку, чтобы изменить!";
	L.DUNGEON_DIFF = "Сложность Подземелий";
	L.DUNGEON_DIFF_DESC = "Настройка сложности для подземелий.\n\nНажмите эту строку, чтобы изменить!";
	L.RAID_DIFF = "Сложность Рейдов";
	L.RAID_DIFF_DESC = "Настройка сложности для рейдов.\n\nНажмите эту строку, чтобы изменить!";
	L.LEGACY_RAID_DIFF = "Сложность Старинных Рейдов";
	L.LEGACY_RAID_DIFF_DESC = "Настройка сложности для старинных рейдов.\n\nНажмите эту строку, чтобы изменить!";
	L.TELEPORT_TO_FROM_DUNGEON = "Телепортировать в/из Подземелья";
	L.TELEPORT_TO_FROM_DUNGEON_DESC = "Нажмите здесь, чтобы телепортировать в/из Вашего текущего подземелья.\n\nВы можете использовать Сценарии Пандарии, чтобы таким образом быстро телепортироваться из текущего подземелья.";
	L.RESET_INSTANCES = "Обновление подземелий";
	L.RESET_INSTANCES_DESC = "Нажмите здесь, чтобы обновить Ваши подземелья.\n\n"..ALT_KEY_TEXT.." клик для переключения автоматического обновления Ваших подземелий, когда Вы выходите из них.\n\nПРЕДУПРЕЖДЕНИЕ: БУДЬТЕ ОСТОРОЖНЫ С ЭТИМ!";
	L.DELIST_GROUP = "Отписать Группу";
	L.DELIST_GROUP_DESC = "Нажмите здесь, чтобы отписать группу. Если Вы сами по себе, то покинете группу без телепортации Вас из подземелья.";
	L.LEAVE_GROUP = "Покинуть Группу";
	L.LEAVE_GROUP_DESC = "Нажмите здесь, чтобы покинуть группу. В большинстве случаев, Вас также телепортирует к ближайшему кладбищу через 60 секунд.\n\nВНИМАНИЕ: Работает только, если Вы в группе или игра считает, что Вы в группе.";
	L.LOOT_SPEC_DESC_2 = "В подземельях, рейдах и событиях в открытом мире с Персональной добычей, данная опция будет диктовать, какие предметы Вам доступны.\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.CURRENT_SPEC = "Текущая Специализация";
	L.CURRENT_SPEC_DESC = "Если Вы меняете Вашу Специализацию, Ваша Специализация для добычи меняется вместе с Вами.";
	L.DUNGEON_DIFF_DESC_2 = "Данная настройка позволяет изменять сложность подземелья.\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.CLICK_TO_CHANGE = "Нажмите, чтобы изменить. (Если доступно)";
	L.RAID_DIFF_DESC_2 = "Данная настройка позволяет изменять сложность рейда.\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.LEGACY_RAID_DIFF_DESC_2 = "Данная настройка позволяет изменять сложность старинного рейда. (До Осады Оргримара)\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.REROLL = "Повторный бросок";
	L.REROLL_DESC = "Нажмите эту кнопку, чтобы сделать повторный бросок, используя активный фильтр.";
	L.APPLY_SEARCH_FILTER = "Применить Фильтр для Поиска";
	L.APPLY_SEARCH_FILTER_DESC = "Пожалуйста, выберите фильтр для поиска.";
	L.SEARCH_EVERYTHING_BUTTON_OF_DOOM = "Нажмите эту Кнопку для поиска... ВСЕГО.";
	L.ACHIEVEMENT_DESC = "Нажмите эту кнопку для выбора случайного достижения, основываясь на том, какие у Вас отсутствуют.";
	L.ITEM_DESC = "Нажмите эту кнопку для выбора случайного предмета, основываясь на том, какие у Вас отсутствуют.";
	L.INSTANCE_DESC = "Нажмите эту кнопку для выбора случайного подземелья, включая сценарии, основываясь на несобранных Штучках.";
	L.DUNGEON_DESC = "Нажмите эту кнопку для выбора случайного подземелья, основываясь на несобранных Штучках.";
	L.RAID_DESC = "Нажмите эту кнопку для выбора случайного рейда, основываясь на несобранных Штучках.";
	L.MOUNT_DESC = "Нажмите эту кнопку для выбора случайного транспорта, основываясь на том, какие у Вас отсутствуют.";
	L.PET_DESC = "Нажмите эту кнопку для выбора случайного питомца, основываясь на том, какие у Вас отсутствуют.";
	L.QUEST_DESC = "Нажмите эту кнопку для выбора случайного задания, основываясь на несобранных Штучках.";
	L.TOY_DESC = "Нажмите эту кнопку для выбора случайной игрушки, основываясь на том, какие у Вас отсутствуют.";
	L.ZONE_DESC = "Нажмите эту кнопку для выбора случайной локации, основываясь на несобранных Штучках.";
	L.GO_GO_RANDOM = "Случайная цель - Получи Их!";
	L.GO_GO_RANDOM_DESC = "Данное окно позволит Вам выбрать случайный предмет или место для выполнения. Получи их!";
	L.CHANGE_SEARCH_FILTER = "Изменение Фильтра для Поиска";
	L.CHANGE_SEARCH_FILTER_DESC = "Нажмите, чтобы изменить фильтр для поиска.";
	L.REROLL_2 = "Повторный бросок: ";
	L.NOTHING_TO_SELECT_FROM = "Не из чего делать случайный выбор. Если включена опция 'Обновлять только видимые окна', то предварительно нужно открыть Основной Список (/att).";
	L.NO_SEARCH_METHOD = "Не выбран метод для поиска.";
	L.PROFESSION_LIST = "Список Профессий";
	L.PROFESSION_LIST_DESC = "Откройте Ваши профессии для кэширования.";
	L.CACHED_RECIPES_1 = "Кэшировано ";
	L.CACHED_RECIPES_2 = " известных рецептов!";
	L.WORLD_QUESTS_DESC = "Эти Локальные Задания и другие ограниченные по времени Штучки сейчас доступны где-либо. Получи их!";
	L.QUESTS_DESC = "Все задания в игре в порядке возрастания номеров.";
	L.UPDATE_WORLD_QUESTS = "Обновить Локальные Задания";
	L.UPDATE_WORLD_QUESTS_DESC = "Иногда API Локальных Заданий медленный или не может получить новые данные. Если Вы хотите принудительно обновить данные без смены локации, нажмите на кнопку!\n\n"..ALT_KEY_TEXT.." клик, чтобы добавить Штучки, которые могут быть не ограниченной доступности.";
	L.CLEAR_WORLD_QUESTS = "Очистить Локальные Задания";
	L.CLEAR_WORLD_QUESTS_DESC = "Нажмите, чтобы очистить текущую информацию в окне Локальных Заданий";
	L.ALL_THE_ITEMS_FOR_ACHIEVEMENTS_DESC = "Все предметы, что могут быть использованы для получения достижений, которые у Вас отсутствуют.";
	L.ALL_THE_APPEARANCES_DESC = "Все облики, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_MOUNTS_DESC = "Все средства передвижения, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_BATTLEPETS_DESC = "Все боевые питомцы, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_QUESTS_DESC = "Все задания, которые начинаются объектом или предметом, что можно купить на аукционе, отображаются здесь.";
	L.ALL_THE_RECIPES_DESC = "Все рецепты, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_ILLUSIONS_DESC = "Все иллюзии, игрушки и другие предметы, что могут помочь пополнить коллекцию, отображаются здесь.";
	L.ALL_THE_REAGENTS_DESC = "Все предметы, что могут быть использованы в создании предмета на Вашем аккаунте.";
	L.AH_SCAN_SUCCESSFUL_1 = ": Успешно сканировано ";
	L.AH_SCAN_SUCCESSFUL_2 = " предмет(ов).";
	L.REAGENT_CACHE_OUT_OF_DATE = "Кэш реагентов устарел и будет обновлен, когда откроете Ваши профессии!";
	L.ARTIFACT_CACHE_OUT_OF_DATE = "Кэш Артефактов устарел и будет обновлен, когда перелогинитесь!";
	L.QUEST_LOOP = "Скорее всего ATT вырвался из цепочки зацикленных заданий.";
	L.QUEST_PREVENTS_BREADCRUMB_COLLECTION_FORMAT = "Задание '%s' %s не позволит собрать Хлебную Кроху '%s' %s";
	L.QUEST_OBJECTIVE_INVALID = "Недействительная Цель Задания";
	L.REFRESHING_COLLECTION = "Обновление коллекции...";
	L.DONE_REFRESHING = "Коллекция обновлена.";
	L.ADHOC_UNIQUE_COLLECTED_INFO = "Этот Предмет сломан в ATT из-за отсутствующей информации от Blizzard. Можно поправить, если вручную обновить коллекцию (Shift+Клик на окне ATT).";
	L.AVAILABILITY = "Доступность";
	L.REQUIRES_PVP = "|CFF00FFDEЭта Штучка требует участия в ПвП или ПвП валюту.|r";
	L.REQUIRES_PETBATTLES = "|CFF00FFDEЭта Штучка требует игру с Боевыми Питомцами.|r";
	L.REPORT_INACCURATE_QUEST = "Неверная Информация о Задании! (Нажмите для Отчёта)";
	L.NESTED_QUEST_REQUIREMENTS = "Вложенные Требования Заданий";
	L.MAIN_LIST_REQUIRES_REFRESH = "[Откройте Основной список, чтобы обновить прогресс]";
	L.DOES_NOT_CONTRIBUTE_TO_PROGRESS = "|cffe08207Эта группа и её содержимое не влияют на прогресс данного окна, так как у этой Штучки уже указан Источник в другом месте!|r";
	L.CURRENCY_NEEDED_TO_BUY = "Примерно необходимо для покупки Не Собранных Штучек";
	L.LOCK_CRITERIA_LEVEL_LABEL = "Уровень Игрока";
	L.LOCK_CRITERIA_QUEST_LABEL = "Выполненное Задание";
	L.LOCK_CRITERIA_SPELL_LABEL = "Выученный Навык/Транспорт/Рецепт";
	L.LOCK_CRITERIA_FACTION_LABEL = "Репутация";
	L.LOCK_CRITERIA_FACTION_FORMAT = "%s с %s (Текущее: %s)";
	L.FORCE_REFRESH_REQUIRED = "Может потребоваться Полное Обновление коллекции ("..SHIFT_KEY_TEXT.." клик).";
	L.FUTURE_UNOBTAINABLE = "Будущие Недоступные!";
	L.FUTURE_UNOBTAINABLE_TOOLTIP = "Это контент, который точно или очень вероятно будет недоступен в будущем патче.";
	L.TRADING_POST = "Торговая лавка";

	-- Item Filter Window
		L.ITEM_FILTER_TEXT = "Фильтровать предметы";
		L.ITEM_FILTER_DESCRIPTION = "Вы можете отфильтровать предметы в ATT при помощи фильтра.";
		L.ITEM_FILTER_BUTTON_TEXT = "Задать фильтр";
		L.ITEM_FILTER_BUTTON_DESCRIPTION = "Нажмите, чтобы поменять фильтр.";
		L.ITEM_FILTER_POPUP_TEXT = "Какой фильтр Вы хотите задать для поиска?";

-- Instructional Text
	L.MINIMAP_MOUSEOVER_TEXT = "Правый клик - Меню Настроек.\nЛевый клик - Основной список.\n"..CTRL_KEY_TEXT.." клик - открыть Мини список.\n"..SHIFT_KEY_TEXT.." клик - Обновить Коллекцию.";
	L.TOP_ROW_INSTRUCTIONS = "|cff3399ffЗажатая Левая кнопка - Перемещение\nПравый клик - Меню Настроек\n"..SHIFT_KEY_TEXT.." клик - Обновить Коллекцию\n"..CTRL_KEY_TEXT.." клик - Свернуть/Развернуть Рекурсивно\n"..SHIFT_KEY_TEXT.." правый клик - Отсортировать список|r";
	L.OTHER_ROW_INSTRUCTIONS = "|cff3399ffКлик - Свернуть/Развернуть\nПравый клик - Открыть Мини список\n"..SHIFT_KEY_TEXT.." клик - Обновить Коллекцию\n"..CTRL_KEY_TEXT.." клик - Свернуть/Развернуть Рекурсивно\n"..SHIFT_KEY_TEXT.." правый клик - Отсортировать список\n"..ALT_KEY_TEXT.." правый клик - Расставить Указатели|r";
	L.TOP_ROW_INSTRUCTIONS_AH = "|cff3399ffЗажатая Левая кнопка - Перемещение\nПравый клик - Меню Настроек\n"..SHIFT_KEY_TEXT.." + Левый Клик - Поиск на Аукционе|r";
	L.OTHER_ROW_INSTRUCTIONS_AH = "|cff3399ffКлик - Свернуть/Развернуть\nПравый клик - Открыть Мини список\n"..SHIFT_KEY_TEXT.." клик - Поиск на Аукционе|r";
	L.RECENTLY_MADE_OBTAINABLE = "|CFFFF0000Если это недавно выпало для Вас (везде, кроме Утиля/Ящиков), пожалуйста, напишите в Discord, где Вы получили предмет!|r";
	L.RECENTLY_MADE_OBTAINABLE_PT2 = "|CFFFF0000Чем больше информации, тем лучше. Спасибо!|r";
	L.TOP_ROW_TO_LOCK = "|cff3399ff"..ALT_KEY_TEXT.." клик - Закрепить это Окно";
	L.TOP_ROW_TO_UNLOCK = "|cffcf0000"..ALT_KEY_TEXT.." клик - Открепить это Окно";
	L.QUEST_ROW_INSTRUCTIONS = "Правый клик - Открыть Цепочку Заданий";
	L.SYM_ROW_INFORMATION = "Правый клик - Показать дополнительный контент из других источников";
	L.QUEST_ONCE_PER_ACCOUNT = "Один-Раз-На-Аккаунт Задание";
	L.COMPLETED_BY = "Выполнено На: %s";
	L.OWNED_BY = "Имеется на %s";

-- Social Module
	L.NEW_VERSION_AVAILABLE = "Доступна новая версия %s. Пожалуйста, обновите Аддон, %s.";
	L.NEW_VERSION_FLAVORS = {
		"или мы дадим Сильване ещё одну зажигалку",
		"Алекстраза беспокоится о Вас",
		"и Непобедимый |cffffaaaaточно|r дропнет в следующий раз",
		"это была всего лишь мелкая помеха",
		"время понизить Ваш %",
		"и черепаха доберётся до воды",
	};
	L.SOCIAL_PROGRESS = "Социальный Прогресс";

-- Settings.lua
	L.AFTER_REFRESH = "После Обновления";

	-- General tab
		-- Mode Title
			L.MODE = "Режим";
			L.TITLE_COMPLETIONIST = "Коллекционер ";
			L.TITLE_UNIQUE_APPEARANCE = "Уникальный ";
			L.TITLE_DEBUG = app.ccColors.Red .. "Отладка|R ";
			L.TITLE_ACCOUNT = app.ccColors.Account.."Учётная Запись|R ";
			L.TITLE_MAIN_ONLY = " (Основной Персонаж)";
			L.TITLE_NONE_THINGS = "Без Штучек ";
			L.TITLE_ONLY = "";
			L.TITLE_INSANE = app.ccColors.Insane.."Безумный|R ";
			L.TITLE_SOME_THINGS = "Некоторые Штучки ";
			L.TITLE_LEVEL = "Уровень ";
			L.TITLE_SOLO = "Соло ";
			L._BETA_LABEL = " |cff4AA7FF[Бета]|R";

		L.MINIMAP_SLIDER = "Размер Кнопки Миникарты";
		L.MINIMAP_SLIDER_TOOLTIP = 'Используйте для установления желаемого размера Кнопки Миникарты.\n\nПо умолчанию: 36';
		L.EXTRA_THINGS_LABEL = "Дополнительные Штучки";
		L.MINIMAP_BUTTON_CHECKBOX = "Показывать Кнопку у Миникарты";
		L.MINIMAP_BUTTON_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите кнопку у миникарты. Эта кнопка позволяет Вам быстро открыть Основной список, показать Ваш общий прогресс и открыть Меню Настроек по Правому Клику.\n\nНекоторые люди не любят захламленность. Альтернативно, Вы можете открыть Основной список командой '/att' в чате. Оттуда Правым Кликом по заголовку открыть Меню Настроек.";
		L.WORLDMAP_BUTTON_CHECKBOX = "Показывать Кнопку на Карте";
		L.WORLDMAP_BUTTON_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите кнопку ATT на Вашей карте. Эта кнопка позволяет открыть Мини список ATT для открытой зоны на карте. В обычной ситуации Вам требуется физически быть в зоне, чтобы набрать '/att mini' в чате.";
		L.CLICK_TO_CREATE_FORMAT = "Нажмите, чтобы создать %s";
		L.LOADING_FORMAT = "%s загружаются...";
		L.READY_FORMAT = "%s загрузились";
		L.KEYBINDINGS_TEXT = "Вы можете назначить клавиши для ATT в настройках игры.";

	-- Interface tab
		L.ADDITIONAL_LABEL = "Дополнительная Информация";
		L.DESCRIPTIONS = "Описания";
		L.LORE = "Лор";
		L.CLASSES = "Классы";

	-- Features tab
		L.MINIMAP_LABEL = "Кнопка у Миникарты";
		L.MODULES_LABEL = "Модули и Мини Списки";
		L.SKIP_CUTSCENES_CHECKBOX = "Авто Пропуск Сцен";
		L.SKIP_CUTSCENES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматичски пропускал все внутриигровые сцены.";
		L.AUTO_BOUNTY_CHECKBOX = "Авто Открывать Список Пропаж";
		L.AUTO_BOUNTY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал список предметов, которые считаются крайне важными для нахождения. Если у Вас получится стащить один из перечисленных здесь предметов, Вы можете сделать получить хорошую сумку золотых.\n\nБыстрая Команда: /attbounty";
		L.AUTO_MAIN_LIST_CHECKBOX = "Авто Открывать Основной Список";
		L.AUTO_MAIN_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал Основной Список при входе в игру.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Основной Список\n\nБыстрая Команда: /att";
		L.AUTO_MINI_LIST_CHECKBOX = "Авто Открывать Мини Список";
		L.AUTO_MINI_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть всё, что можно собрать в текущей локации. Этот список будет автоматически изменяться при смене зоны. Некоторым людям не нравится данная особенность, но когда Вы играете соло, данная опция крайне полезна.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Мини Список\n\nБыстрая Команда: /att mini";
		L.AUTO_PROF_LIST_CHECKBOX = "Авто Открывать Список Профессии";
		L.AUTO_PROF_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал и обновлял список профессии, когда Вы открываете Ваши профессии. Из-за навязанных ограничений API, аддоны могут взаимодействовать с профессиями только, когда они открыты. Этот список будет автоматически переключаться, когда Вы открываете другую профессию.\n\nМы не рекомедуем отключать данную опцию, поскольку она может предотватить некорректное отслеживание рецептов.\n\nВы также можете назначить клавишу для данной настройки (работает только при открытой профессии):\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Список Профессии";
		L.AUTO_RAID_ASSISTANT_CHECKBOX = "Авто Открывать Рейдового Помощника";
		L.AUTO_RAID_ASSISTANT_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал альтернативное окно для управления настройками группы/рейда под названием 'Рейдовый Помощник'. Список автоматически обновляется, когда настройки группы меняются.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Рейдового Помощника\n\nБыстрая Команда: /attra";
		L.AUTO_WQ_LIST_CHECKBOX = "Авто Открывать Локальные Задания";
		L.AUTO_WQ_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал Список 'Локальных Заданий'. Этот список автоматически обновляется, когда Вы меняете локацию.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Локальные Задания\n\nБыстрая Команда: /attwq";
		L.AUCTION_TAB_CHECKBOX = "Показать Модуль Ауциона";
		L.AUCTION_TAB_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Модуль Аукциона ATT.\n\nНекоторые модификации - плохие ребята, и значительно изменяют это окно. ATT не всегда хорошо играет с такими игрушками.";
		L.ICON_LEGEND_LABEL = "Аннотация иконок";
		L.ICON_LEGEND_TEXT = app.ccColors.White .. "|T" .. app.asset("status-unobtainable") .. ":0|t " .. "Недоступно" .. "\n|T" .. app.asset("status-prerequisites") .. ":0|t " .. "Доступно с условием" .. "\n|T" .. app.asset("status-seasonal-available") .. ":0|t " .. "Доступная Праздничная Штучка" .. "\n|T" .. app.asset("status-seasonal-unavailable") .. ":0|t " .. "Недоступная Праздничная Штучка" .. "\n|T374225:0|t " .. "Недоступно на текущем персонаже";
		L.CHAT_COMMANDS_LABEL = "Команды Чата";
		L.CHAT_COMMANDS_TEXT = "/att |cffFFFFFFили|R /things |cffFFFFFFиои|R /allthethings\n|cffFFFFFFОткрыть Главный Список.\n\n|R/att mini |cffFFFFFFиои|R /attmini\n|cffFFFFFFОткрыть Мини Список.\n\n|R/att bounty\n|cffFFFFFFОткрыть список забагованных или неподтверждённых предметов.\n\n|R/att ra |cffFFFFFFили|R /attra\n|cffFFFFFFОткрыть Рейдовый Помощник.\n\n|R/att wq |cffFFFFFFили|R /attwq\n|cffFFFFFFОткрыть Список Локальных Заданий.\n\n|R/att item:1234 |cffFFFFFFили|R /att [Ссылка на Предмет]\n|cffFFFFFFОткрыть окно общих моделей. Также работает с другими Штучками, например, |R quest:1234|cffFFFFFF, |Rnpcid:1234|cffFFFFFF, |Rmapid:1234|cffFFFFFF или |Rrecipeid:1234|cffFFFFFF.\n\n|R/att rwp\n|cffFFFFFFПоказать все Штучки, которые будет невозможно получить в будущем.\n\n|R/att nwp\n|cffFFFFFFПоказать все Штучки, добавленные в последнем патче.\n\n|R/att random |cffFFFFFFили|R /attrandom |cffFFFFFFили|R /attran\n|cffFFFFFFОткрыть Случайный Список.\n\n|R/att unsorted\n|cffFFFFFFОткрыть список несортированных Штучек. Лучше в Режиме Отладки.\n\n|R/rl\n|cffFFFFFFПерезагрузить интерфейс WoW.|R";

	-- Sync Window
		L.ACCOUNT_MANAGEMENT = "Управление Аккаунтами";
		L.ACCOUNT_MANAGEMENT_TOOLTIP = "Данный список отображает весь функционал относительно синхронизации данных учётной записи.";
		L.ADD_LINKED_CHARACTER_ACCOUNT = "Прикрепить Персонажа / Аккаунт";
		L.ADD_LINKED_CHARACTER_ACCOUNT_TOOLTIP = "Нажмите, чтобы прикрепить персонажа или учётную запись к Вашей учётной записи.";
		L.ADD_LINKED_POPUP = "Пожалуйста, введите имя персонажа или учётную запись BNET для прикрепления.";
		L.SYNC_CHARACTERS_TOOLTIP = "Здесь отображаются все персонажи на Вашей учётной записи.";
		L.NO_CHARACTERS_FOUND = "Персонажей не найдено.";
		L.LINKED_ACCOUNTS = "Прикреплённые Аккаунты";
		L.LINKED_ACCOUNTS_TOOLTIP = "Здесь отображаются все прикреплённые учётные записи.";
		L.NO_LINKED_ACCOUNTS = "Прикреплённых аккаунтов не найдено.";
		L.LINKED_ACCOUNT_TOOLTIP = "Учётная запись данного персонажа будет автоматически синхронизироваться при входе в игру. Для оптимальной игры Вам лучше добавить персонажа-банкира, а не основного персонажа, чтобы процесс сихронизации не влиял на процесс игры на основном персонаже.";
		L.DELETE_LINKED_CHARACTER = "Правый Клик - Удалить этого Прикреплённого Персонажа";
		L.DELETE_LINKED_ACCOUNT = "Правый Клик - Удалить этот Прикреплённый Аккаунт";
		L.DELETE_CHARACTER = "Правый Клик - Удалить этого Персонажа";
		L.CONFIRM_DELETE = "\n \nВы точно хотите удалить это?";

	-- Binding Localizations
		L.TOGGLE_ACCOUNT_MODE = "Переключить режим Аккаунта";
		L.TOGGLE_COMPLETIONIST_MODE = "Переключить режим Собирателя";
		L.TOGGLE_DEBUG_MODE = "Переключить режим Отладки";
		L.TOGGLE_FACTION_MODE = "Переключить режим Фракции";
		L.TOGGLE_COMPLETEDTHINGS = "Переключить Собранные Предметы (Все)";
		L.TOGGLE_COMPLETEDGROUPS = "Переключить Собранные Группы";
		L.TOGGLE_COLLECTEDTHINGS = "Переключить Собранные Предметы";
		L.TOGGLE_BOEITEMS = "Переключить БоЕ/БоА Предметы";
		L.TOGGLE_SOURCETEXT = "Переключить Расположение Источников";
		L.MODULES = "Модули";
		L.TOGGLE_MAINLIST = "Переключить Основной Список";
		L.TOGGLE_MINILIST = "Переключить Мини Список";
		L.TOGGLE_PROFESSION_LIST = "Переключить Список Профессии";
		L.TOGGLE_WORLD_QUESTS_LIST = "Переключить Локальные Задания";
		L.TOGGLE_RAID_ASSISTANT = "Переключить Рейдового Помощника";
		L.TOGGLE_RANDOM = "Переключить Рандомизатор";
		L.REROLL_RANDOM = "Повторный бросок Рандомизатора";

	-- Event Text
		L.ITEM_ID_ADDED = "%s (%d) добавлен в Вашу коллекцию.";
		L.ITEM_ID_ADDED_RANK = "%s (%d) [Ранг %d] добавлен в Вашу коллекцию.";
		L.ITEM_ID_ADDED_MISSING = "%s (%d) добавлен в Вашу коллекцию. Не найден в базе данных. Пожалуйста, сообщите в Discord ATT!";
		L.ITEM_ID_ADDED_SHARED = "%s (%d) [+%d] были добавлены в Вашу коллекцию.";
		L.ITEM_ID_ADDED_SHARED_MISSING = "%s (%d) [+%d] были добавлены в Вашу коллекцию. Не найдены в базе данных. Пожалуйста, сообщите в Discord ATT!";
		L.ITEM_ID_REMOVED = "%s (%d) был удален из Вашей коллекции.";
		L.ITEM_ID_REMOVED_SHARED = "%s (%d) [+%d] были удалены из Вашей коллекции.";

	-- Tooltip Text
		L.DROP_RATE = "Шанс Выпадения";
		L.QUEST_GIVER = "Начинает Задание";
		L.EVENT_SCHEDULE = "Расписание События";
		L.EVENT_ACTIVE = "Активно:";
		L.EVENT_START = "Начало:";
		L.EVENT_END = "Конец:";
		L.EVENT_WHERE = "Когда:";
		L.REQUIRES_EVENT = "Требуется Событие";
		L.LOCKOUT = "Сохранение";
		--TODO: L.RESETS = "Resets";
		L.SHARED = "Все Сложности";
		L.SPLIT = "Отдельные Сложности";
		L.REQUIRES_LEVEL = "Требуется Уровень";
		L.SECRETS_HEADER = "Секреты";
		L.LIMITED_QUANTITY = "Предмет имеется в ограниченном количестве и может не всегда быть доступен у торговца.";
		L.SOURCE_ID_MISSING = "Пожалуйста, сообщите в канале #retail-errors на нашем сервере Discord, где Вы нашли эту вещь!";
		L.ADDED_WITH_PATCH_FORMAT = "Добавлено в %s";
		L.WAS_ADDED_WITH_PATCH_FORMAT = "Добавлено в %s";
		L.ADDED_BACK_WITH_PATCH_FORMAT = "Добавлено снова в %s";
		L.WAS_ADDED_BACK_WITH_PATCH_FORMAT = "Добавлено снова в %s";
		L.REMOVED_WITH_PATCH_FORMAT = "Удалено в %s";

	-- Filter Text
		L.CREATURES_COUNT = "[%s Существ]";
		L.CREATURES_LIST = "Список Существ";

	-- Artifact Relic Completion
		--TODO: L.ARTIFACT_RELIC_CACHE = "Open your Artifact UI for all of your Artifact Weapons to cache whether this is an upgrade or not. This is useful for determining if you can trade this item to a Twink or not.";
		--TODO: L.ARTIFACT_RELIC_COMPLETION = "Artifact Relic Completion";
		--TODO: L.NOT_TRADEABLE = "Not Tradeable";
		--TODO: L.TRADEABLE = "Tradeable";

	-- Keybind usage
		--TODO: L.ENABLED = "enabled";
		--TODO: L.DISABLED = "disabled";

	-- Icons and Collection Text
		L.COLLECTED = "|T" .. app.asset("known") .. ":0|t |cff15abffСобрано|r";	-- Acquired the colors and icon from CanIMogIt.
		L.COLLECTED_APPEARANCE = "|T" .. app.asset("known_circle") .. ":0|t |cff15abffСобрано*|r";	-- Acquired the colors and icon from CanIMogIt.
		L.NOT_COLLECTED = "|T" .. app.asset("unknown") .. ":0|t |cffff9333Не Собрано|r";	-- Acquired the colors and icon from CanIMogIt.
		L.COMPLETE = "|T" .. app.asset("known_green") .. ":0|t |cff6dce47Выполнено|r";	-- Acquired the colors and icon from CanIMogIt.
		L.COMPLETE_OTHER = "|T" .. app.asset("known_green") .. ":0|t |cff6dce47Выполнено*|r";	-- Acquired the colors and icon from CanIMogIt.
		L.INCOMPLETE = "|T" .. app.asset("incomplete") .. ":0|t |cff15abffНе Выполнено|r";	-- Acquired the colors and icon from CanIMogIt.
		L.SAVED = "|T" .. app.asset("known_green") .. ":0|t |cff6dce47Сохранено|r";	-- Acquired the colors and icon from CanIMogIt.
		L.COST_TEXT = "|T" .. app.asset("Currency") .. ":0|t |cff0891ffВалюта|r";

local a = L.ABBREVIATIONS;
for key,value in pairs({
	["Анторус, Пылающий Трон"] = "Анторус";	-- ["Antorus, the Burning Throne"] = "Antorus"
	["Expansion Pre"] = "Препатч";
	["Особый контент"] = "ОК";
	[GROUP_FINDER] = "П и Р";	-- ["Dungeons & Raids"] = "D&R"
	["Cataclysm "] = "Ката ";
	["Темные Земли"] = "ТЗ",
	["Player vs Player"] = "ПвП";
	["Поиск рейда"] = "ЛФР";
	["Обычный"] = "О";
	["Героический"] = "Г";
	["Эпохальный"] = "Э";
	["Тайный рынок Тазавеш"] = "Тазавеш";	-- ["Tazavesh, the Veiled Market"] = "Tazavesh"
	["10 игроков"] = "10";
	["25 игроков"] = "25";
	["героич."] = "гер.";
	["Локальные задания"] = "ЛЗ",	-- ["World Quests"] = "WQ"
	["годовщина World of Warcraft"] = "годовщина";
	["Ковенант:"] = "Ков:",
})
do a[key] = value; end

if app.IsRetail then
local a = L.HEADER_NAMES;
for key,value in pairs({
	-- Tier/Dungeon/Event/Holiday Sets
		-- Artifact Strings
			[-5200] = "Основной облик",								-- Base Appearance
			[-5201] = "Кампания оплота",							-- Class Hall Campaign
			[-5202] = "Баланс Сил",									-- Balance of Power
			[-5203] = "Награды за Престиж",							-- Prestige Rewards
			[-5204] = "Облик Испытаний",							-- Challenge Appearance
			[-5205] = "Скрытый облик",								-- Hidden Appearance
})
do a[key] = value; end
end

local a = L.SETTINGS_MENU;
for key,value in pairs({
	-- Common Header
		SKIP_AUTO_REFRESH = "Не авто обновлять при изменении настроек!";
		SKIP_AUTO_REFRESH_TOOLTIP = "По умолчанию (выключено) любое изменение Настроек, которое меняет отображаемую информацию, будет авто обновлять коллекцию.\n\nПосле включения этой опции, изменения Настроек не будут менять отображение, пока Вы не произведёте Полное Обновление коллекции, сделав "..SHIFT_KEY_TEXT.." клик на окне ATT.";

	-- About Page
		ABOUT_PAGE = "Об аддоне";
		ABOUT_TOP = " |CFFFFFFFF- модификация для отслеживания коллекции, которая показывает Вам где и как получить всё в игре! У нас большое сообщество в Discord (ссылка внизу), где Вы можете спрашивать, оставлять предложения, а также сообщать об ошибках и пропавших предметах. Если Вы нашли предмет или задание, которые не задокументированы, Вы можете сказать нам в Discord, для более технически подкованных у нас Git, в котором Вы можете участвовать.\n\nПока мы стремимся к выполнению, есть множество вещей, что добавляются в игру с каждым патчем, и если что-то отсутствует, пожалуйста, поймите, у нас небольшая команда, пытающаяся держать темп с изменениями, в то же время собирая Штучки. :D\n\nНе стесняйтесь спрашивать меня во время трансляций, даже если вопрос не связан напрямую с ATT (стандартное программирование аддонов WoW тоже).\nПримечание переводчика: на английском языке.\n\n- |r|Cffff8000Crieve|r";
		ABOUT_BOTTOM = "Активные Участники: |CFFFFFFFF(в алфавитном порядке)\n%s!\n|rЗал Славы: |CFFFFFFFF(в алфавитном порядке)\n%s\n\nОсобая Благодарность AmiYuy (CanIMogIt) и Caerdon (Caerdon Wardrobe). Вы просто обязаны загрузить их аддоны для иконок коллекций в Ваших сумках! %s %s %s\n\nДля онлайн-сравнения коллекций посетите DataForAzeroth.com от Shoogen и WoWthing.org от Freddie!|r";
		CLIPBOARDCOPYPASTE = "Ctrl+A, Ctrl+C, чтобы скопировать в буфер обмена.";
		CURSEFORGE_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на ALL THE THINGS на Curse.\n\nВы можете дать эту ссылку своим друзьям, чтобы они тоже разрушили свою жизнь! В конце концов они Вас простят...может быть.";
		DISCORD_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на Discord сервер All The Things.\n\nВы можете делиться своим прогрессом или фрустрацией с другими собирателями!\n\nПримечание переводчика: на английском языке.";
		MERCH_BUTTON_LABEL = "Мерч";
		MERCH_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на магазин мерчендайза All The Things.\n\nТам вы можете поддержать аддон финансово и получить за это крутой мерч!";
		PATREON_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на Patreon All The Things.\n\nТам вы можете поддержать аддон финансово!";
		TWITCH_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на мой канал Twitch.\n\nВы можете задавать вопросы, когда трансляция онлайн, и я постараюсь на них ответить!\n\nПримечание переводчика: на английском языке.";
		WAGO_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на ALL THE THINGS на Wago.io.\n\nВы можете дать эту ссылку своим друзьям, чтобы они тоже разрушили свою жизнь! В конце концов они Вас простят...может быть.";

	-- General Page
		DEBUG_MODE = app.ccColors.Red.."Режим Отладки|r (Показать Всё)";
		DEBUG_MODE_TOOLTIP = "Буквально... ВСЕ ШТУКИ В ИГРЕ. ОКОНЧАТЕЛЬНО. ТОЧКА. АГА, ВСЕ ОНИ. Даже Несобираемые штуки, как сумки, расходуемые, реагенты и прочие, появятся в списках. (Даже Вы сами! Нет, серьёзно. Смотрите.)\n\nДанный режим только для отладки. Не предназначен для отслеживания выполнения.\n\nЭтот режим игнорирует все фильтры, включая Несобираемые.";
		ACCOUNT_MODE = app.ccColors.Account.."Режим Аккаунта";
		ACCOUNT_MODE_TOOLTIP = "Включите данную настройку, если Вы хотите отслеживать Штучки для всех Ваших персонажей, независимо от фильтров расы и класса.\n\nФильтры Недоступных по-прежнему применяются.";
		FACTION_MODE = "Только Фракция";
		FACTION_MODE_TOOLTIP = "Включите данную настройку, если Вы хотите отслеживать Штучки в Режиме Аккаунта только для рас и классов Вашей текущей фракции.";
		LOOT_MODE = "Режим Лута";
		LOOT_MODE_TOOLTIP = "Включите данную настройку, если Вы хотите отслеживать весь лут.\n\nВы можете отрегулировать отображаемый лут на вкладке Фильтры.";
		MODE_EXPLAIN_LABEL = "|cffFFFFFFЗдесь кратко изложено то, что Вы собираете. Включите все "..app.ccColors.Insane.."цветные параметры|cffFFFFFF, чтобы разблокировать "..app.ccColors.Insane.."Безумный Режим|cffFFFFFF.";
		COMPLETIONIST_MODE = "+Источники";
		COMPLETIONIST_MODE_TOOLTIP = "Включите данный режим, чтобы считать все Предметы Собранными только тогда, когда определённый Предмет был открыт для данного Облика.\n\nЭто означает, что Вы должны получить каждый общий Облик для Предмета.\n\nПримечание: По умолчанию, игра перестаёт сообщать Вам о Предметах, которые Вы собрали после получения общего Источника, поэтому данный режим позволит отслеживать несобранные Предметы.";
		MAIN_ONLY = "Только основной персонаж";
		MAIN_ONLY_TOOLTIP = "Включите данную функцию, если Вы также хотите ATT *притворяться*, что Вы собрали все общие облики, непривязанные к определённому классу или расе.\n\nНапример, если Вы собрали набор Охотника из ЦЛК, и у него есть общие облики без ограничения по классу/расе, ATT *притворится*, что Вы также собрали этот источник облика.\n\nПримечание: Переключение на другую расу/класс некорректно сообщит, что Вы собрали источники обликов, которые на самом деле не собраны для этого персонажа.";
		--TODO: ONLY_RWP = "Only RWP";
		--TODO: ONLY_RWP_TOOLTIP = "Enable this option to only track transmog that get removed from the game in the future. Only Items tagged with 'removed with patch' data count toward this. If you find an item not tagged that should be tagged, please let me know!\n\nYou can change which sort of loot displays for you based on the Filters tab.";
		--TODO: UNOFFICIAL_SUPPORT_TOOLTIP = "NOTE: At this time, official support is not provided by WoW's API, but ATT can track items or quest completion to make it functional in the addon.";

	-- General Content
		GENERAL_CONTENT = "Общее содержимое";
		SHOW_INCOMPLETE_THINGS_CHECKBOX = "Все Отслеживаемые Штучки";
		SHOW_INCOMPLETE_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть все предметы, объекты, НИПов и заголовки, которые могут отслеживаться внутри игры и не обязательно считаться 'собираемыми'.\n\nВы можете использовать эту функцию для помощи в выполнении достижения Хранитель Мудрости, если Вы ещё не получили его.\n\nПримечание: Редкие или Виньетки также появляются в списках при включении этой настройки.";
		SHOW_COMPLETED_GROUPS_CHECKBOX = "Показать Выполненные Группы";
		SHOW_COMPLETED_GROUPS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть выполненные группы как заголовок с процентом выполнения. Если группа не имеет ничего важного для Вашего класса, эта настройка также отобразит такие группы в списке.\n\nМы рекомендуем Вам отключить эту настройку, поскольку будет занимать место в Мини списке и мешать быстро определить, что доступно в текущей зоне.";
		SHOW_COLLECTED_THINGS_CHECKBOX = "Показать Собранные Штучки";
		SHOW_COLLECTED_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, чтобы видеть Штучки, которые уже были Собраны.\n\nМы рекомендуем Вам отключить эту настройку, поскольку будет занимать место в Мини списке и мешать быстро определить, что доступно в текущей зоне.";
		FILTER_THINGS_BY_LEVEL_CHECKBOX = "Без Фильтра по Уровню";
		FILTER_THINGS_BY_LEVEL_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть контент, который может быть недоступен Вам по уровню.\n\nПримечание: Особенно полезно выключать на пробных учётных записях.";
		--TODO: FILTER_THINGS_BY_SKILL_LEVEL_CHECKBOX = "No Skill Level Restrictions";
		--TODO: FILTER_THINGS_BY_SKILL_LEVEL_CHECKBOX_TOOLTIP = "Disable this setting if you only want to see content available to the maximum possible skill level available to the game environment.";
		SHOW_BOE_CHECKBOX = "БоЕ/БоА Предметы";
		SHOW_BOE_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите отслеживать Персональные при Надевании/Привязанные к аккаунту предметы.\n\nПолезно выключить, когда Вы пытаетесь закончить Классические Подземелья для персонажа и не хотите специально фармить предметы, которые могут быть получены на альтах или Аукционе.\n\nТо есть: Не лишитесь рассудка во время гринда Маятника Рока.";
		IGNORE_FILTERS_FOR_BOES_CHECKBOX = "Игнорировать Фильтры БоЕ/БоА";
		IGNORE_FILTERS_FOR_BOES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите игнорировать требования по типу брони, оружия, расе, классу или профессии для БоЕ/БоА предметов.\n\nЕсли Вы стремитесь собрать штучки для Ваших альтов через Аукцион, этот режим может быть полезен для Вас.";
		SHOW_ALL_SEASONAL = "Все праздничные события";
		SHOW_ALL_SEASONAL_TOOLTIP = "Включите это настройку для отображения всех Праздничных Событий вместо активных на текущий момент.\n\nПРИМЕЧАНИЕ: Праздничные События становятся видны за 7 дней до начала.";
		SHOW_PET_BATTLES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите отслеживать весь контент, который требует Битвы Питомцев.";
		SHOW_PVP_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите отслеживать весь контент, который 'может' требовать ПвП.";
		SHOW_ALL_LEARNABLE_QUEST_REWARDS_CHECKBOX = "Недоступный Персональный Лут";	-- TODO: All Learnable Quest Rewards
		SHOW_ALL_LEARNABLE_QUEST_REWARDS_CHECKBOX_TOOLTIP = "Выключите данную опцию, что спрятать вещи, которые являются \"Недоступными в Персональном Луте\" в заданиях.\n\nУдобно для отслеживания вещей, которые Ваш класс не может получить в Мировых Дропах, но в то же время помечая задания как выполненные.\n\nНекоторые вещи могут быть помечены неверно: данная настройка СПРЯЧЕТ часть вещей, которые вы можете получить!";

		-- Collectible Things
		ACC_WIDE_DEFAULT = "Отслеживается на "..app.ccColors.Account.."Весь Аккаунт|R по умолчанию.";
		TRACK_ACC_WIDE = app.ccColors.Account.."Отслеживать на весь аккаунт|R";
		ACCOUNT_THINGS_LABEL = "Штучки для всего аккаунта";
		GENERAL_THINGS_LABEL = "Общие Штучки";
		STRANGER_THINGS_LABEL = "Очень Странные Штучки";

		--TODO: ACHIEVEMENTS_CHECKBOX = ACHIEVEMENTS;
		ACHIEVEMENTS_CHECKBOX_TOOLTIP = "Включите для отслеживания достижений.";
		APPEARANCES_CHECKBOX = "Внешний вид";
		APPEARANCES_CHECKBOX_TOOLTIP = "Включите для отслеживания получения обликов.\n\nПримечание: Отключение данной опции также отключит все фанфары и рассчёты о получении. Вы можете отключить для избежания лагов во время занятия важным групповым контентом, но держите в уме, что рассчёты будут произведены при обратном включении.";
		BATTLE_PETS_CHECKBOX = "Боевые питомцы";
		BATTLE_PETS_CHECKBOX_TOOLTIP = "Включите для отслеживания боевых питомцев и спутников. Могут быть обнаружены в открытом мире или в качестве добычи с боссов в различных Подземельях или Рейдах, равно как у торговцев и различных фракций.";
		--TODO: DEATHS_CHECKBOX = "Deaths";
		--TODO: DEATHS_CHECKBOX_TOOLTIP = "Enable this option to track each time one of your characters die and show it as a Collectible section within the addon.\n\nNOTE: If you turn this off, we'll still track it, but we simply will not show the statistic unless you're in Debug Mode.";
		--TODO: EXPLORATION_CHECKBOX = "Exploration";
		--TODO: EXPLORATION_CHECKBOX_TOOLTIP = "Enable this option to track exploration completion for outdoor maps.";
		FLIGHT_PATHS_CHECKBOX = "Полёты & Паромные Станции";
		FLIGHT_PATHS_CHECKBOX_TOOLTIP = "Включите для отслеживания путей полётов и паромных станций.\n\nЧтобы *собрать* их, начните разговор с распорядителем полётов/паромной станции на каждом континенте.\n\nПримечание: Из-за технологии фазирования, Вам может потребоваться перейти в другую версию локации, чтобы засчитать эти достопримечательности.";
		--TODO: HEIRLOOMS_CHECKBOX = HEIRLOOMS;
		HEIRLOOMS_CHECKBOX_TOOLTIP = "Включите для отслеживания разблокирования Наследства и его соответствующих Уровней Улучшения.\n\nНаследство, которое ассоциируется с Облком, фильтруется фильтром Обликов. (отключение обликов всё также отобразит Наследство)\n\nНекоторые предметы, имеющие качество Наследства, также помогают улучшать репутации и могут быть отфильтрованы фильтром Репутации.";
		HEIRLOOMS_UPGRADES_CHECKBOX = "+Улучшения";
		HEIRLOOMS_UPGRADES_CHECKBOX_TOOLTIP = "Включите для отслеживания индивидуальных улучшений для Наследства.\n\nМы все знаем, что Blizzard любит высасывать Ваше золото и душу, так что следите за ними с данным переключателем.";
		--TODO: ILLUSIONS_CHECKBOX = "Illusions";
		ILLUSIONS_CHECKBOX_TOOLTIP = "Включите для отслеживания чар для оружия.\n\nЭто круто выглядящие эффекты, которые можно применить к Вашему оружию!\n\nПримечание: Вы не иллюзия, невзирая на то, как считают все Ночнорождённые.";
		--TODO: MOUNTS_CHECKBOX = MOUNTS;
		MOUNTS_CHECKBOX_TOOLTIP = "Включите для отслеживания транспорта.\n\nВы можете ездить на них, чтобы перемещаться из точки А в точку Б быстрее, чем бегом. Кто бы мог подумать!";
		--TODO: QUESTS_CHECKBOX = QUESTS_LABEL;
		QUESTS_CHECKBOX_TOOLTIP = "Включите для отслеживания обычных Заданий.\n\nПри помощи правого клика на любое задание в списках Вы можете открыть полную цепочку заданий, чтобы отобразить Ваш прогресс и любые предшествующие Задания.\n\nПримечание: Задания не отслеживаются перманентно из-за природы отслеживания Ежедневных, Еженедельных, Ежегодных и Локальных заданий в базе данных Blizzard.";
		QUESTS_LOCKED_CHECKBOX = "+Ограниченные";
		QUESTS_LOCKED_CHECKBOX_TOOLTIP = "Включите для специального отслеживания выполнения Ограниченных Заданий.\n\nОграниченные Задания - это те, которые игрок не может выполнить (исходя из известных ATT данных) при обычной игре.\n\nПолучение этих Заданий полагается на Синхронизацию группы или отслеживание заданий для Всего Аккаунта";
		RECIPES_CHECKBOX = "Рецепты";
		RECIPES_CHECKBOX_TOOLTIP = "Включите для отслеживания рецептов для Ваших профессий\n\nПримечание: Вы должны открыть Ваши профессии, чтобы кэшировать известные рецепты.";
		REPUTATIONS_CHECKBOX = "Репутации";
		REPUTATIONS_CHECKBOX_TOOLTIP = "Включите для отслеживания репутаций.\n\nПосле достижения Превознесения или статуса Лучший друг, будет отмечено как Собрано.\n\nМожет потребоваться ручное обновление коллекции, чтобы засчитать их корректно.";
		TITLES_CHECKBOX = "Звания";
		TITLES_CHECKBOX_TOOLTIP = "Включите для отслеживания званий.\n\nОни выделяют Вашего персонажа и показывают, как давно Вы играете. Обычно только у новых игроков нет выбранного звания.";
		--TODO: TOYS_CHECKBOX = TOY_BOX;
		TOYS_CHECKBOX_TOOLTIP = "Включите для отслеживания игрушек.\n\nБольшинство из них имеют забавные эффекты. Другие же, как игрушечные Камни возвращения, могут быть использованы вместо обычного Камня возвращения и сохранить Вам место в сумке! Они также имеют интересные эффекты... Здорово!";

		-- Expansion Things
		EXPANSION_THINGS_LABEL = "Штучки Дополнений";
		AZERITE_ESSENCES_CHECKBOX = "|T"..app.asset("Expansion_BFA")..":0|t Азеритовые сущности";
		AZERITE_ESSENCES_CHECKBOX_TOOLTIP = "Включите для отслеживания Азеритовых Сущностей.\n\nПо умолчанию отслеживается на каждом персонаже отдельно.";
		DRAKEWATCHERMANUSCRIPTS_CHECKBOX = "|T"..app.asset("Expansion_DF")..":0|t Манускрипты наблюдений за драконами";
		DRAKEWATCHERMANUSCRIPTS_CHECKBOX_TOOLTIP = "Включите для отслеживания Манускриптов наблюдений за драконами Dragonflight";
		FOLLOWERS_CHECKBOX = "|T"..app.asset("Expansion_WOD")..":0|t Соратники & Спутники";
		FOLLOWERS_CHECKBOX_TOOLTIP = "Включите для отслеживания соратников и чемпионов.\n\nТо есть: Соратники в Гарнизоне, Чемпионы Оплота Класса в Легионе, Спутники Битвы за Азерот, а также Спутники из Тёмных Земель.";
		RUNEFORGELEGENDARIES_CHECKBOX = "|T"..app.asset("Expansion_SL")..":0|t Легендарки ТЗ";
		RUNEFORGELEGENDARIES_CHECKBOX_TOOLTIP = "Включите для отслеживания Легендарных предметов Тёмных Земель.";
		SOULBINDCONDUITS_CHECKBOX = "|T"..app.asset("Expansion_SL")..":0|t Проводники";
		SOULBINDCONDUITS_CHECKBOX_TOOLTIP = "Включите для отслеживания Проводников Медиумов.";

		CHARACTERUNLOCKS_CHECKBOX = "Разблокирования Персонажа";
		CHARACTERUNLOCKS_CHECKBOX_TOOLTIP = "Включите для отслеживания Разблокирований Персонажа. Это различные разблокирования, которые не могут быть отнесены к другим типам (например, варианты Сглазов и Превращений, разблокирования питомцев для Охотников, кастомизации Покопока и прочее).\n\nПо умолчанию отслеживается на каждом персонаже отдельно.";

		-- Account-Wide Checkboxes
		ACCOUNT_WIDE_ACHIEVEMENTS_TOOLTIP = "Достижения обычно отслеживаются на всю учётную запись, но есть некоторые эксклюзивные для определённых классов или рас достижения, которые Вы не сможете получить на основном персонаже.";
		--TODO: ACCOUNT_WIDE_APPEARANCES_TOOLTIP = "Transmog should be collected account wide. Certain items cannot be learned by every class, so ATT will do its best to only show you things that you can collect on your current character.";
		ACCOUNT_WIDE_AZERITE_ESSENCES_TOOLTIP = "Азеритовые Сущности технически не могут быть собраны и использованы на всю учётную запись, но если Вам важно только собрать их на основном персонаже, то Вам предпочтительнее отслеживать их на всю учётную запись.";
		--TODO: ACCOUNT_WIDE_BATTLE_PETS_TOOLTIP = "Companion pets can be collected on multiple characters and realistically would require that you have an insane amount of bag space in order to collect them all on one character.\n\nWe recommend you keep this turned on, but you do you fam.";
		ACCOUNT_WIDE_CHARACTERUNLOCKS_TOOLTIP = "Включите, чтобы считать Разблокирования Персонажа собранными, если хотя бы один персонаж имеет к ним доступ.";
		--TODO: ACCOUNT_WIDE_DEATHS_TOOLTIP = "Death tracking really only exists for pre-Wrath Classic where a statistic wasn't available to know this information. Once achievements were implemented, this feature instead acquires data directly from the statistics API. You can use the tooltip on the Death Tracker to se";
		--TODO: ACCOUNT_WIDE_EXPLORATION_TOOLTIP = "Exploration tracking is only really useful per character, but do you really want to collect them all on all 50 of your characters?";
		ACCOUNT_WIDE_FLIGHT_PATHS_TOOLTIP = "Отслеживание Путей Полётов отдельное на каждого персонажа, но Вы действительно хотите собирать их на всех Ваших 50 персонажах?";
		ACCOUNT_WIDE_FOLLOWERS_TOOLTIP = "Спутники обычно считаются по персонажу, но Вы же не хотите собирать 243 спутника в Таверне Гарнизона по одному в неделю?\n\nОчень сомневаюсь.";
		ACCOUNT_WIDE_QUESTS_TOOLTIP = "Выполнение заданий чаще всего считается отдельно для каждого персонажа, но с этой настройкой будет засчитываться, если хоть один персонаж выполнил задание.";
		ACCOUNT_WIDE_RECIPES_TOOLTIP = "Рецепты не отслеживаются на всю учётную запись в базе данных Blizzard, но мы можем делать это сами.\n\nНевозможно собрать их все на одном персонаже, поэтому Вы можете придать значение профессиям своих альтов.";
		ACCOUNT_WIDE_REPUTATIONS_TOOLTIP = "Репутации теперь отслеживаются на всю учётную запись для достижений в базе данных Blizzard, так что включение этой опции может быть хорошей идеей.";
		ACCOUNT_WIDE_SOULBINDCONDUITS_TOOLTIP = "Включите, чтобы считать Проводники Медиумов собранными, если хотя бы один персонаж имеет к ним доступ.";
		ACCOUNT_WIDE_TITLES_TOOLTIP = "Большинство званий отслеживается на всю учётную запись, но некоторые престижные звания в WoW закреплены за персонажем, получившим их.\n\nПереключите эту опцию, если они Вам не важны, и Вы хотите видеть эти звания Собранными на Ваших альтах.";

	-- General: Filters Page
		ITEM_EXPLAIN_LABEL = "|cffFFFFFFЭти предметы всегда видимы в "..app.ccColors.Account.."Режиме Аккаунта|cffFFFFFF.|r";
		CLASS_DEFAULTS_BUTTON = "Классовые";
		CLASS_DEFAULTS_BUTTON_TOOLTIP = "Нажмите на эту кнопку, чтобы сбросить все фильтры к стандартным для Вашего класса.\n\nПримечание: Только фильтры, которые могут быть собраны Вашим классом, будут включены.";
		ALL_BUTTON_TOOLTIP = "Нажмите на эту кнопку, чтобы включить все фильтры сразу.";
		UNCHECK_ALL_BUTTON_TOOLTIP = "Нажмите на эту кнопку, чтобы отключить все фильтры.";

	-- General: Phases Page
	-- Classic Only, fully dynamic from within parser.

	-- General: Unobtainables Page
		UNOBTAINABLES_PAGE = "Недоступные";
		UNOBTAINABLE_LABEL = "Недоступный контент";
		CUSTOM_FILTERS_LABEL = "Автоматический контент";
		CUSTOM_FILTERS_EXPLAIN_LABEL = "|CFFFFFFFFЭти Штучки всегда показываются, если они доступны текущему персонажу или в "..app.ccColors.Account.."Режиме Аккаунта|cffFFFFFF.|r";
		CUSTOM_FILTERS_GENERIC_TOOLTIP_FORMAT = "Включите данную настройку, чтобы всегда показывать %s, даже если это недоступно на данном персонаже.";

	-- Interface Page
		TOOLTIP_LABEL = "Подсказки";
		TOOLTIP_HELP_CHECKBOX = "Показать Помощь в Подсказке";
		TOOLTIP_HELP_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть вспомогательную информацию в подсказке над окнами ATT, показывающую различные комбинации клавиш для управления.\nЕсли Вы уже знаете все комбинации, вполне резонно отключить их, чтобы уменьшить размер подсказок.";
		ENABLE_TOOLTIP_INFORMATION_CHECKBOX = "Интеграция Подсказок";
		ENABLE_TOOLTIP_INFORMATION_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть информацию ATT во всплывающих подсказках. Включает в себя подсказки в ссылках на предметов от других игроков, предметы на аукционе, в путеводителе по приключениям, в Ваших сумках, в мире, над НИПами и т.п.\n\nЕсли Вы выключите данную функцию, Вы серьёзно снизите Вашу возможность быстро определить, нужно ли убить моба или изучить данный облик.\n\nМы рекомендуем оставить эту опцию включённой.";
		DISPLAY_IN_COMBAT_CHECKBOX = "В Бою";
		DISPLAY_IN_COMBAT_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите показывать информацию в подсказках во время боя.\n\nЕсли Вы рейдите с Вашей Эпохальной/Эпохальной+ гильдией, Вы, возможно, должны отключить эту настройку, чтобы снизить нагрузку на систему.\n\nОпция может быть полезна, когда Вы проходите старый контент, чтобы сразу знать, что Вам нужно с босса.";
		TOOLTIP_MOD_LABEL = "Модификатор";
		TOOLTIP_SHOW_LABEL = "Отображаемая Информация";
		SHOW_COLLECTION_PROGRESS_CHECKBOX = "Прогресс Коллекции";
		SHOW_COLLECTION_PROGRESS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Ваш прогресс к получению Штучки или завершении группы Штучек в Правом Верхнем углу подсказки.\n\nМы рекомендуем оставить эту опцию включенной.";
		ICON_ONLY_CHECKBOX = "Только Иконка";
		ICON_ONLY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть только иконку в углу подсказки вместо иконки и надписи собрано/не собрано.\n\nНекоторым людям нравятся подсказки поменьше...";
		KNOWN_BY_CHECKBOX = "Изучено";
		KNOWN_BY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке полный список персонажей на всех серверах, которые изучили данный рецепт.";
		COMPLETED_BY_CHECKBOX = "Выполнено";
		COMPLETED_BY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке полный список персонажей на всех серверах, которые выполнили данное Задание.";
		--TODO: SHOW_CRAFTED_ITEMS_CHECKBOX = "Show Crafted Items";
		--TODO: SHOW_CRAFTED_ITEMS_CHECKBOX_TOOLTIP = "Enable this option if you want to see a list of all of the items that can be crafted by any of your characters for a reagent in its tooltip.";
		--TODO: SHOW_RECIPES_CHECKBOX = "Show Recipes";
		--TODO: SHOW_RECIPES_CHECKBOX_TOOLTIP = "Enable this option if you want to see a list of all of the recipes that can be crafted by any of your characters for a reagent in its tooltip.";
		--TODO: SHOW_ONLY_NON_TRIVIAL_RECIPES_CHECKBOX = "Only Non-Trivial";
		--TODO: SHOW_ONLY_NON_TRIVIAL_RECIPES_CHECKBOX_TOOLTIP = "Enable this option if you only want to see non-trivial recipes in the recipe list.";
		SHOW_CURRENCY_CALCULATIONS_CHECKBOX = "Рассчет покупок";
		SHOW_CURRENCY_CALCULATIONS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке приблизительное количество Предметов/Валюты, необходимое для покупки Штучек.\n\nДля Контейнеров, которые не гарантируют получение всего содержимого за раз, оценка затрат будет ниже.";
		SHARED_APPEARANCES_CHECKBOX = "Общие Облики";
		SHARED_APPEARANCES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке предметы, которые имеют общий облик.\n\nПримечание: Предметы, которые не совпадают по типу брони отображаются в списке для того, чтобы определить прогресс Коллекции.\n\nЕсли Вы путаетесь в них, начиная с ATT v1.5.0, Вы можете Правым Кликом по предмету \"открыть\" предмет и его собственный Мини Список со всеми Общими Обликами.";
		INCLUDE_ORIGINAL_CHECKBOX = "Оригинал";
		INCLUDE_ORIGINAL_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вам нравится видеть в подсказке оригинальный источник среди списка Общих Обликов.";
		ONLY_RELEVANT_CHECKBOX = "Только Уместные";
		ONLY_RELEVANT_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть только те общие облики, которые Ваш персонаж может открыть.\n\nПримечание: Мы рекомендуем оставить эту опцию выключенной, поскольку знание требований для разблокирования может быть полезным для понимания, почему предмет считается Не Собранным.";
		SPEC_CHECKBOX = "Специализации";
		SPEC_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке информацию о специализации для добычи предмета, выданную Игровым Клиентом.\n\nПримечание: Эти иконки будут отображаться в мини списках ATT независимо от этой настройки.";
		SUMMARIZE_CHECKBOX = "Суммировать Штучки";
		SUMMARIZE_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите суммировать Штучки в подсказках. Например, если Штучка может быть отдана Торговцу для другой Штучки, тогда в подсказке покажется эта вторая Штучка для отображения её различных использований. Если Штучка служит Контейнером для других Штучек, то эта опция покажет все другие Штучки, что этот контейнер содержит.\n\nМы рекомендуем оставить эту опцию включённой.";
		CONTAINS_SLIDER_TOOLTIP = 'Используйте для изменения числа суммирующихся Штучек для отображения в подсказке.\n\nПо умолчанию: 25';
		SOURCE_LOCATIONS_CHECKBOX = "Местонахождение\nИсточников";
		SOURCE_LOCATIONS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке полную информацию о Местонахождении Источников для объектов в базе данных ATT.";
		LOCATIONS_SLIDER_TOOLTIP = 'Используйте для изменения количества локаций источников для отображения в подсказке.\n\nПримечание: Также будет показывать количество других источников, основываясь на том сколько их, если же общее число равно общему числу отображаемых элементов, то просто покажет последний источник.\n\nПо умолчанию: 5';
		COMPLETED_SOURCES_CHECKBOX = "Для Собранных";
		COMPLETED_SOURCES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть местонахождение выполненных источников в подсказке.\n\nНапример, если Вы выполнили задание \"Батранов волос\" в Ясеневом Лесу, подсказка для Орендила Широколиста больше не будет показывать это задание.";
		DROP_CHANCES_CHECKBOX = "Шанс Выпадения";
		DROP_CHANCES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть шанс выпадения в подсказке.\nМожет быть полезно для выбора специализации при Бонусном Броске.";
		FOR_CREATURES_CHECKBOX = "Для Существ";
		FOR_CREATURES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Местонахождение Источников для Существ.";
		FOR_THINGS_CHECKBOX = "Для Штучек";
		FOR_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Местонахождение Источников для Штучек.";
		FOR_UNSORTED_CHECKBOX = "Для Несортированного";
		FOR_UNSORTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Местонахождение Источников, которые не были полностью отсортированы в базе данных.";
		WITH_WRAPPING_CHECKBOX = "Сокращение";
		WITH_WRAPPING_CHECKBOX_TOOLTIP = "Включите данную опцию, чтобы сокращать строки в подсказках.\nЭта функция будет контролировать ширину подсказки, чтобы не увеличилась слишком сильно, но она также сократит читаемость источников в большинстве случаев.";

		BEHAVIOR_LABEL = "Настройки Списков";
		MAIN_LIST_SLIDER_LABEL = "Масштаб Основого Списка";
		MAIN_LIST_SCALE_TOOLTIP = 'Используйте для изменения масштаба Основного Списка.\n\nПо умолчанию: 1';
		MINI_LIST_SLIDER_LABEL = "Масштаб Мини Списков";
		MINI_LIST_SCALE_TOOLTIP = 'Используйте для изменения масштаба Мини и Других Списков.\n\nПо умолчанию: 1';
		ADHOC_UPDATES_CHECKBOX = "Обновлять только видимые окна";
		ADHOC_UPDATES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите обновлять только открытые окна ATT.\n\nЭта опция может серьёзно ускорить загрузку и предотвратить фризы в некоторых ситуациях.";
		EXPAND_DIFFICULTY_CHECKBOX = "Развернуть Текущую Сложность";
		EXPAND_DIFFICULTY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите автоматически минимизировать заголовки в мини списке, которые не активны, когда Вы входите в подземелье или рейд.\n\nПример: Минимизировать Героический заголовок, когда в Обычной сложности подземелья.";
		--TODO: SHOW_ICON_PORTRAIT_CHECKBOX = "Icon Portraits";
		--TODO: SHOW_ICON_PORTRAIT_CHECKBOX_TOOLTIP = "Enable this option if you want to see creature icon portraits instead of the default icons for non-quest object types.\n\nIE: When looking at bosses, this option will show the face of the boss instead of the difficulty icon.\n\nDefault: On";
		--TODO: SHOW_ICON_PORTRAIT_FOR_QUESTS_CHECKBOX = "For Quests";
		--TODO: SHOW_ICON_PORTRAIT_FOR_QUESTS_CHECKBOX_TOOLTIP = "Enable this option if you want to see creature icon portraits instead of the default icons for quest object types.\n\nIE: When looking at quests, this option will show the face of the quest giver instead of the quest type icon.\n\nDefault: On";
		SHOW_MODELS_CHECKBOX = "Предпоказ";
		SHOW_MODELS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке модель вместо иконки.\n\nДанная настройка может помочь идентифицировать Редкого монстра или Торговца по внешнему виду. Возможно, Вы захотите оставить опцию включенной по этой причине.";
		FILL_DYNAMIC_QUESTS_CHECKBOX = "Считать Валюту собираемой";
		FILL_DYNAMIC_QUESTS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите считать валюту/предметы, которые можно использовать для получения собираемых Штучек, тоже считать собираемыми в наградах Заданий.";
		FILL_NPC_DATA_CHECKBOX = "Расширенная вложенность для NPC";
		FILL_NPC_DATA_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть все вложенные данные для существ (Общая добыча, Добыча, и т.п.) отображаемых в мини-списке. Эта опция может привести к значительному дублированию Штучек, но идея в том, чтоб существа оставались в мини-списке, как будто с них что-то ещё нужно.\n\nПо умолчанию: отключено";
		NESTED_QUEST_CHAIN_CHECKBOX = "Вложенные Требования Заданий";
		NESTED_QUEST_CHAIN_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы окно Требования Цепочек Заданий (Правый Клик по Заданию) показывало требующиеся Задания как подгруппы их последующих заданий, то есть они должны быть выполнены изнутри наружу.\n\nЭто полезно, чтобы не пропустить Хлебные Крохи, и должно быть использовано по большей части для завершения Заданий как цель.\n\nВ противном случае, Требования Цепочек Заданий будет отображаться списком сверху-вниз, с самым ранним доступным Заданием на самом верху.";
		SORT_BY_PROGRESS_CHECKBOX = "Сортировать по Прогрессу";
		SORT_BY_PROGRESS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы операция 'Сортирования' ("..SHIFT_KEY_TEXT.." правый клик) сортировала по общему прогрессу каждой группы (вместо 'по имени').";
		SHOW_REMAINING_CHECKBOX = "Показать Оставшиеся Штучки";
		SHOW_REMAINING_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите количество оставшися предметов вместо прогресса и общего числа.";
		PERCENTAGES_CHECKBOX = "Показать Процент Завершения";
		PERCENTAGES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть процент завершения в каждом ряду.\n\nНе влияет на окрашивание групп.";
		PRECISION_SLIDER = "Уровень точности";
		PRECISION_SLIDER_TOOLTIP = 'Используйте для установления желаемой точности для процентных рассчётов.\n\nПо умолчанию: 2';
		DYNAMIC_CATEGORY_LABEL = "Динамические Категории";
		DYNAMIC_CATEGORY_SIMPLE = "Простые";
		DYNAMIC_CATEGORY_SIMPLE_TOOLTIP = "Генерировать Динамические Категории только на основе самой общей Категории.";
		DYNAMIC_CATEGORY_NESTED = "Вложенные";
		DYNAMIC_CATEGORY_NESTED_TOOLTIP = "Генерировать Динамические Категории на основе точного Источника. Это приводит к повторам Штучек, которые имеют несколько Источников.";
		DYNAMIC_CATEGORY_TOOLTIP_NOTE = "\n\n|cffff0000Применяется при Генерации|r";
		--TODO: MAX_TOOLTIP_TOP_LINE_LENGTH_LABEL = "Maximum Top Line Length";

	-- Interface: Accessibility Page
		--TODO: ACCESSIBILITY_PAGE = ACCESSIBILITY_LABEL;
		--TODO: ACCESSIBILITY_EXPLAIN = COLORBLIND_MODE_SUBTEXT;
		COLORS_ICONS = "Цвета и Иконки";
		LOCKED_QUESTS = "Ограниченные задания";
		MORE_COLORS_CHECKBOX = "Использовать Цвета";
		MORE_COLORS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть больше использованных цветов, помогающих различать дополнительные условия для Штучек в списках (то есть цвета классов, фракций и т.п.)";
		WINDOW_COLORS = "Цвет окна";
		--TODO: BACKGROUND = EMBLEM_BACKGROUND;
		BACKGROUND_TOOLTIP = "Установка фонового цвета для всех окон ATT.";
		BORDER = "Рамка";
		BORDER_TOOLTIP = "Установка цвета рамки для всех окон ATT.";
		RESET_TOOLTIP = "Сбросить к настройкам по умолчанию.";
		CLASS_BORDER = "Использовать цвет класса для рамки";
		CLASS_BORDER_TOOLTIP = "Использовать цвет вашего класса для рамки. Цвет также обновляется, когда Вы на другом классе.";

	-- Interface: Information Page

	-- Features Page

	-- Features: Audio Page
		CELEBRATIONS_LABEL = "Поздравления и Звуковые Эффекты";
		AUDIO_CHANNEL = "Канал звука";
		CELEBRATE_COLLECTED_CHECKBOX = "Собранная Штучка заслуживает Поздравления";
		CELEBRATE_COLLECTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите слышать фанфары, когда Вы получаете новую Штучку.\n\nДанная опция сильно помогает сохранять мотивацию.";
		SOUNDPACK = "Набор звуковых эффектов";
		PLAY_DEATH_SOUND_CHECKBOX = "Проигрывать звук при смерти";
		PLAY_DEATH_SOUND_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите слышать звук при смерти.";
		WARN_REMOVED_CHECKBOX = "Убранная Штучка вызывает Предупреждение";
		WARN_REMOVED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите слышать предупреждающий звуковой эффект, когда Вы случайно продаёте обратно или передаёте предмет, который добавил Вам облик, который Вы потеряете из своей коллекции.\n\nМожет быть крайне полезно, если Вы продаёте торговцу предмет с таймером возврата. Аддон скажет Вам, что совершаете ошибку.";
		SCREENSHOT_COLLECTED_CHECKBOX = "Собранная Штучка заслуживает Скриншота";
		SCREENSHOT_COLLECTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите делать скриншот, когда Вы получаете новую Штучку.";

	-- Features: Reporting Page
		REPORTING_LABEL = "Сообщения";
		REPORT_COLLECTED_THINGS_CHECKBOX = "Сообщать о Собранных Штучках";
		REPORT_COLLECTED_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть сообщение в чате, объясняющее, какие предметы Вы получили или удалили из коллекции.\n\nПримечание: Эта настройка присутствует потому, что Blizzard бесшумно добавляет облики и другие собираемые предметы и не считает нужным оповещать Вас о дополнительных предметах, доступных Вам.\n\nМы рекомендуем оставить эту опцию включенной. Вы будете всё также слышать фанфары, если отключите её, если они включены.";
		REPORT_COMPLETED_QUESTS_CHECKBOX = "Сообщать о Заданиях";
		REPORT_COMPLETED_QUESTS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть QuestID для каждого задания, которое Вы приняли или выполнили. (Для сообщения об ошибках, для отслеживания и т.п)";
		REPORT_UNSORTED_CHECKBOX = "Только 'Без Источника'";
		REPORT_UNSORTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть QuestID задания, только если у него обозначен Источник.";
		--TODO: REPORT_NEARBY_CONTENT_CHECKBOX = "Report Nearby Content";
		--TODO: REPORT_NEARBY_CONTENT_CHECKBOX_TOOLTIP = "Enable this option if you want to see nearby content such as vignettes to the chat. This feature provides popouts and waypoints when used.";
		--TODO: REPORT_NEARBY_CONTENT_AUTOMATICALLY_PLOT_WAYPOINTS_CHECKBOX = "Automatically Plot Waypoints";
		--TODO: REPORT_NEARBY_CONTENT_AUTOMATICALLY_PLOT_WAYPOINTS_CHECKBOX_TOOLTIP = "Enable this option if you want ATT to automatically plot waypoints for nearby content.";
		--TODO: REPORT_NEARBY_CONTENT_CLEAR_WAYPOINTS_CHECKBOX = "Automatically Clear";
		--TODO: REPORT_NEARBY_CONTENT_CLEAR_WAYPOINTS_CHECKBOX_TOOLTIP = "Enable this option if you want ATT to automatically clear the waypoint plotted by the nearby content feature when the content itself becomes unavailable or you go out of range.";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_CREATURES_CHECKBOX = "Include Creatures";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_CREATURES_CHECKBOX_TOOLTIP = "Enable this option if you want to see nearby content notifications for things that are considered creatures. (Rares, World Bosses, NPCs)";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_TREASURES_CHECKBOX = "Include Treasures";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_TREASURES_CHECKBOX_TOOLTIP = "Enable this option if you want to see nearby content notifications for things that are considered treasures. (Chests, Statues, Satchels in the world)";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_COMPLETED_CHECKBOX = "Include Completed";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_COMPLETED_CHECKBOX_TOOLTIP = "Enable this option if you want to see nearby content notifications from things that completed based on your filters in ATT.";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_UNKNOWN_CHECKBOX = "Include Unknown/Unsourced";
		--TODO: REPORT_NEARBY_CONTENT_INCLUDE_UNKNOWN_CHECKBOX_TOOLTIP = "Enable this option if you want to see nearby content notifications from things that are not sourced in ATT.";
		--TODO: REPORT_NEARBY_CONTENT_FLASH_THE_TASKBAR_CHECKBOX = "Flash the Taskbar";
		--TODO: REPORT_NEARBY_CONTENT_FLASH_THE_TASKBAR_CHECKBOX_TOOLTIP = "Enable this option if you want ATT to flash the taskbar when nearby content is detected.";
		--TODO: REPORT_NEARBY_CONTENT_PLAY_SOUND_EFFECT_CHECKBOX = "Play a Sound Effect";
		--TODO: REPORT_NEARBY_CONTENT_PLAY_SOUND_EFFECT_CHECKBOX_TOOLTIP = "Enable this option if you want ATT to also play a notification sound effect when nearby content is detected.";

	-- Features: Sync Page
	-- Retail Only, deprecated.
		SYNC_PAGE = "Синхронизация";
		ACCOUNT_SYNCHRONIZATION = "Сихронизация Аккаунтов";
		AUTO_SYNC_ACC_DATA_CHECKBOX = "Автоматически Синхронизировать Данные Аккаунтов";
		AUTO_SYNC_ACC_DATA_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT пытался автоматически синхронизировать данные между учётными записями во время перезахода в игру или перезагрузки интерфейса.";

	-- Features: Windows Page
	-- Classic Only, nothing localizable atm.
		--TODO: WINDOWS_PAGE = "Windows";

	-- Profiles Page
		PROFILES_PAGE = "Профили";
		PROFILE = "Профиль";
		PROFILE_INITIALIZE = "Инициализировать Профили";
		PROFILE_INITIALIZE_TOOLTIP = "Включить поддержку Профилей. Ваши текущие Настройки и позиции окон будут скопированы в Профиль '"..DEFAULT.."', который нельзя будет удалить, но можно будет отредактировать, и который будет использован как начальный Профиль на всех персонажах.\n\nПожалуйста, сообщайте обо всех ошибках и необычном поведении Профилей на сервере ATT Discord!";
		PROFILE_INITIALIZE_CONFIRM = "Вы уверены, что хотите включить поддержку Профилей?";
		PROFILE_NEW_TOOLTIP = "Создать пустой Профиль для использования текущим персонажем";
		PROFILE_COPY_TOOLTIP = "Скопировать Выделенный Профиль в Текущий Профиль";
		PROFILE_DELETE_TOOLTIP = "Удалить Выделенный Профиль";
		PROFILE_SWITCH_TOOLTIP = "Установить Выделенный Профиль как Текущий Профиль\n\nИли кликните на Профиль с зажатым "..SHIFT_KEY_TEXT;
		SHOW_PROFILE_LOADED = "Показывать Текущий Профиль после загрузки и после смены Профиля";
})
do a[key] = value; end

if app.IsRetail then
local a = L.CUSTOM_COLLECTS_REASONS;
for key,value in pairs({
	["NPE"] = { icon = "|T"..(3567434)..":0|t", color = "ff5bc41d", text = "Новый Персонаж", desc = "Только Новый Персонаж может собрать эти предметы." },
	["SL_SKIP"] = { icon = "|T"..app.asset("Expansion_SL")..":0|t", color = "ff76879c", text = "Нити Судьбы", desc = "Только Персонаж, который пропустил сюжет Тёмных Земель, может собрать эти предметы." },
	["HOA"] = { icon = "|T"..(1869493)..":0|t", color = "ffe6cc80", text = GetSpellName(275825), desc = "Только Персонаж с |cffe6cc80Сердцем Азерот|r может собрать эти предметы." },
	["!HOA"] = { icon = "|T"..(2480886)..":0|t", color = "ffe6cc80", text = "|cffff0000Без|r Сердца Азерот", desc = "Только Персонаж |cffff0000без|r |cffe6cc80Сердца Азерот|r может собрать эти предметы." },
})
do a[key] = value; end
end