-- Localization for Russian Clients.
if GetLocale() ~= "ruRU" then return; end
local app = select(2, ...);
local L = app.L;

DRAKE_MANUSCRIPTS = "Манускрипты наблюдений за драконами";
TRACK_ACC_WIDE = app.ccColors.Account.."тслеживать на весь аккаунт|R";
ACC_WIDE_DEFAULT = "Отслеживается на "..app.ccColors.Account.."Весь Аккаунт|R по умолчанию.";

-- General Text
	L.DESCRIPTION = "\"Глупцы! Вы сами нашли свою погибель! Вам никогда не понять, сколь велика сила, потревоженная вами.  Вы сражались отчаянно, чтобы проникнуть в царство Жнеца. Теперь перед вами лежит лишь один путь – путь проклятых.\"";
	L.THINGS_UNTIL = " ШТУЧЕК ДО ";
	L.THING_UNTIL = " ШТУЧКА ДО ";
	L.YOU_DID_IT = "ВЫ СДЕЛАЛИ ЭТО!|r";

-- Big new chunk from AllTheThings.lua
	L.PROGRESS = "Прогресс";
	L.TRACKING_PROGRESS = "Отслеживание выполнения";
	L.COLLECTED_STRING = " Собрано";
	L.PROVIDERS = "Начинает";
	L.COLLECTION_PROGRESS = "Прогресс Коллекции";
	L.CONTAINS = "Содержит:";
	L.FACTIONS = "Фракции";
	L.COORDINATES_STRING = "Координаты";
	L.NO_COORDINATES_FORMAT = "Нет координат для %s";
	L.TOM_TOM_NOT_FOUND = "Нужен TomTom, чтобы ставить Указатели.";
	L.FLIGHT_PATHS = "Пути Полётов";
	L.KNOWN_BY = "Изучено ";
	L.REQUIRES = "Требуется";
	L.RACE_LOCKED = "Ограничено Расой";
	L.PLEASE_REPORT_MESSAGE = "Пожалуйста, сообщите об этом на Discord-сервере ATT в канале #retail-errors! Спасибо!";
	L.REPORT_TIP = "\n("..CTRL_KEY_TEXT.."+C, чтобы скопировать многострочный отчёт в буфер обмена)";
	L.NOT_AVAILABLE_IN_PL = "Недоступно в Персональной добыче.";
	L.MARKS_OF_HONOR_DESC = "Почётные знаки должны быть рассмотрены во всплывающем окне, чтобы видеть всё их 'Содержимое'.\n(Введите '/att' в чат и затем "..SHIFT_KEY_TEXT.." клик для ссылки на предмет)\n\n|cFFfe040fПосле покупки и использования Набора может потребоваться полностью выйти из игры и вручную обновить коллекцию (в таком порядке),\nчтобы корректно зарегистрировать все предметы.|r";
	L.ITEM_GIVES_REP = "Улучшает Репутацию с '";
	L.COST = "Стоимость";
	L.COST_DESC = "Содержит визуальную справку о предметах, необходимых для покупки или получения данной Штучки";
	L.SOURCES = "Источник(и)";
	L.SOURCES_DESC = "Показывает Источник этой Штучки.\n\nВ частности, конкретный торговец/НИП, Задание, Событие и т.д.";
	L.WRONG_FACTION = "Вы должны быть за другую фракцию, чтобы видеть это.";
	L.ARTIFACT_INTRO_REWARD = "Выдаётся в награду за выполнение вводного задания для данного Артефакта.";
	L.FACTION_SPECIFIC_REP = "Не все репутации видны одному персонажу. Например, Всадники Песни Войны не видны Игрокам Альянса, а Среброкрылые Часовые - Игрокам Орды.";
	L.VISIT_FLIGHT_MASTER = "Посетите Распорядителя Полётов для добавления в кэш.";
	L.FLIGHT_PATHS_DESC = "Пути Полётов засчитываются, когда Вы говорите с Распорядителем Полётов на каждом континенте.\n  - Crieve";
	L.FOLLOWERS_COLLECTION_DESC = "Спутники могут быть собраны на Весь Аккаунт, если включена соответствующая опция.\n\nВы должны вручную обновить коллекцию через "..SHIFT_KEY_TEXT.." клик по заголовку, чтобы они засчитались.";
	L.HEIRLOOM_TEXT = "Разблокированное Наследство";
	L.HEIRLOOM_TEXT_DESC = "Показывает, получено или нет данное наследство.";
	L.FAILED_ITEM_INFO = "Не удалось получить информацию о предмете. Предмет может быть неправильный или ещё не был кэширован на Вашем сервере.";
	L.HEIRLOOMS_UPGRADES_DESC = "Показывает, улучшили ли Вы наследство до определённого уровня или нет.\n\nПокойся с миром, Золото.\n - Crieve";
	L.MUSIC_ROLLS_AND_SELFIE_DESC = "Эти Штучки открываются на каждом персонаже отдельно и на данный момент не распределяются на Вашу учётную запись. Если кто-нибудь из Blizzard читает это, будет просто шикарно, если Вы сделаете их на весь аккаунт.\n\nВы должны вручную обновить коллекцию через "..SHIFT_KEY_TEXT.." клик по заголовку, чтобы засчитать эту Штучку.";
	L.MUSIC_ROLLS_AND_SELFIE_DESC_2 = "\n\nСначала нужно разблокировать Мелодии, выполнив задание \"Врубай басы\" в Вашем гарнизоне, чтобы данный предмет мог выпасть.\n\nДля фильтров нужно иметь Камеру СЕЛФИ 2.0.";
	L.OPPOSITE_FACTION_EQ = "Эквивалент противоположной фракции: ";
	L.SELFIE_DESC = "Сделайте селфи, используя вашу ";
	L.SELFIE_DESC_2 = " с |cffff8000";
	L.TIER_DATA[1].name = "Classic";
	L.TIER_DATA[1].lore = "Полный решимости заселить засушливые земли Дуротара, Тралл позволил Отрекшимся присоединиться к Орде, состоявшей из орков, тауренов и троллей. В то же время дворфы, гномы и древние ночные эльфы присягнули Альянсу, управляемому королевством людей. После таинственного исчезновения короля Штормграда Вариана Ринна, регентом был назначен Верховный лорд Болвар Фордрагон, но истинная власть находилась в руках черного дракона Ониксии, скрывавшейся под личиной дворянки и подчинившей Фордрагона своей воле. По мере того как герои узнавали новые подробности страшного заговора, во всех концах мира пробуждались древние силы, представлявшие угрозу как для Альянса, так и для Орды.";
	L.TIER_DATA[2].lore = "Владыка Судеб Каззак вновь открыл Темный портал в Запределье, из которого в Азерот хлынули кровожадные демоны Пылающего Легиона. Эльфы крови и дренеи присоединились к экспедиционным силам Альянса и Орды, которые отправились через портал в самое сердце Запределья, чтобы нанести поражение демонам прямо в их логове. На испепеленном Полуострове Адского Пламени в Запределье герои Альянса обнаружили нескольких своих соплеменников, которые давным-давно прошли через портал. В это же время воины Орды встретились с «неоскверненными» орками из племени Маг'хар, которые не участвовали во вторжении на Азерот. В ходе кампании в Запределье союзные войска все больше увязали в конфликте с Легионом и подручными Иллидана Ярости Бури, который распространил свое влияние на все уголки разрушенного мира.";
	L.TIER_DATA[3].lore = "Когда Солнечный Колодец был очищен от скверны, в мире наступило спокойствие, причем настолько безмятежное, что просто не могло не вызвать подозрений. Внезапно, как по сигналу, войска Плети приступили к планомерному нападению на города по всему Азероту уже и за пределами Восточных Королевств. Вождь Тралл был вынужден принять решительные меры и направил в Нордскол экспедиционный корпус под началом Гарроша Адского Крика. Тем временем в Штормград, наконец, вернулся король людей Вариан Ринн и занял свое законное место на престоле. На бой с Королем-личом он выставил внушительное войско Альянса под командованием Болвара Фордрагона. Кроме того, воины Альянса должны были подавить любое сопротивление Орды.";
	L.TIER_DATA[4].lore = "Экспедиции в Нордскол вернулись с победой, но внезапно на Азерот обрушились разгневанные элементали — знак, что грядет возвращение аспекта драконов Смертокрыла Разрушителя. Он покинул свое логово и принес в Азерот разрушение, открыв проходы в Царство Стихий, через которые хлынули беснующиеся элементали и их владыки. Они намерены помочь Смертокрылу и отвратительному культу Сумеречного Молота приблизить Время Сумерек и уничтожить все живое в Азероте.";
	L.TIER_DATA[5].lore = "От Смертокрыла мир удалось спасти, и вождь Гаррош Адский Крик решил: когда, как не теперь, нанести удар по Альянсу и расширить владения Орды в Калимдоре. Под натиском его армии пал и был разрушен до основания город людей Терамор. По всему миру противостояние между фракциями разгорелось с новой силой. После крупного морского сражения остатки флота Орды и Альянса прибило к туманным берегам Пандарии — таинственного континента, не отмеченного ни на одной карте. На берегу этой богатой земли враждующие фракции встретили благородных пандаренов — один из главных местных народов. Пандарены вступили в союз с Альянсом и Ордой, надеясь с их помощью изгнать со своих земель злобных ша — бестелесных созданий, явившихся на свет из недр Пандарии в давней кровопролитной войне.";
	L.TIER_DATA[6].lore = "Гаррош Адский Крик бежал от правосудия, в чем ему помог бронзовый дракон Кайроздорму. Бывшему вождю удалось вернуться назад во времени и попасть на Дренор еще до вторжения Орды в Азерот. Поддавшись жажде мести, Гаррош выдал своему отцу, Громмашу Адскому Крику, все технологии для создания идеальной армии для завоевания других миров — Железной Орды. Громмаш объединил все разрозненные кланы орков Дренора под своим знаменем, сделав их вождей своими военачальниками. В число приближенных вошли кровожадный Каргат Острорук, хитрый Чернорук, старый шаман Нер'зул и бесстрашный Килрогг Мертвый Глаз. Железная Орда захватила ряд ключевых областей Дренора, покорила город огров из клана Верховного Молота и построила крупные военные объекты вроде литейной клана Черной горы, снабжающей армии Орды оружием. Завладев Дренором, орки Железной Орды вторглись в Азерот через Темный портал, разорили крепость Стражей Пустоты и захватили форт Молота Ужаса. В ответ на нападение верховный маг Кадгар призвал на помощь героев Альянса и Орды и повел их через портал на Дренор, чтобы остановить Железную Орду раз и навсегда. В итоге Гаррош пал от руки Тралла, а героям Азерота удалось в ходе продолжительной и тяжелой кампании уничтожить большую часть военачальников Железной Орды. Возглавляемое Кадгаром наступление позволило нанести сокрушительный удар Железной Орде. Громмаш не смог привести своих воинов к обещанной победе, и в рядах его последователей назрел раскол. Это позволило чернокнижнику Гул'дану захватить власть в Железной Орде и призвать на Дренор демонов Пылающего Легиона...";
	L.TIER_DATA[7].lore = "После битвы за Дренор коварный Гул'дан очутился в Азероте. Под влиянием демонического владыки Кил'джедена Искусителя он открыл гробницу Саргераса, а вместе с ней — врата, через которые Пылающий Легион вторгся в Азерот. Чернокнижник покорил Расколотые острова, включая древний город ночнорожденных Сурамар, и подчинил своей воле их лидера, Великого магистра Элисанду. Альянс и Орда штурмовали Расколотый берег в надежде остановить Гул'дана и предотвратить вторжение Легиона, но их усилия оказались тщетны и стоили жизни королю Вариану Ринну и вождю Вол'джину. Тогда верховный маг Кадгар предпринял отчаянную попытку объединить раздробленные фракции, что привело к восстановлению Столпов Созидания — единственного инструмента, способного вновь запечатать гробницу. Жители Расколотых островов освободились от влияния Легиона, а силы Альянса и Орды приблизились к базе Гул'дана, Цитадели Ночи, в надежде раз и навсегда положить конец зловещим амбициям чернокнижника...";
	L.TIER_DATA[8].lore = "Когда Саргерас нанес Азерот страшную рану, из недр планеты поднялась нестабильная субстанция, прозванная азеритом — кровь самого спящего титана. Вскоре Альянс и Орда поняли, какой потенциал сокрыт в этом веществе, и взаимная неприязнь перешла в открытую конфронтацию. В стремлении завладеть как можно большим количеством азерита, Орда сожгла Тельдрассил, а затем Альянс осадил Подгород.\n\nОбе фракции были ослаблены и нуждались в новых союзниках и в героях, которые бы помогли их найти. Так Джайна Праудмур отправилась на свою родину, Кул-Тирас, в надежде уговорить морскую державу вновь присоединиться к Альянсу. Однако местные дворянские дома погрязли в конфликтах и проявили единодушие лишь в ненависти к Джайне за ее прошлые поступки. В то же время герои Орды вызволили зандаларскую принцессу Таланджи из тюрьмы Штормграда. И, хотя сперва ее отец, король Растахан, не был настроен слушать послов, со временем Таланджи все-таки уговорила зандаларских троллей присоединиться к Орде. Дипломатия помогла обеим фракциям, и в результате успешных военных кампаний они основали надежные базы в Зандаларе и Кул-Тирасе.\n\nДобившись доверия со стороны своих новых союзников, Альянс и Орда вновь скрестили клинки, не замечая, что над ними нависли грозные волны возмездия…";
	L.TIER_DATA[9].lore = "Одним отчаянным ударом Сильвана Ветрокрылая разрушила границу между миром живых и загробным царством. Храбрейших защитников Азерота затянула всепожирающая тьма. Несущая смерть древняя сила грозит сбросить оковы и уничтожить саму реальность.\n\nТех, кто осмелится сделать шаг в царство мертвых, ждут чудесные и пугающие неизведанные миры. Темные земли — это царство, в котором обитают души умерших. Это мир между мирами, от хрупкого баланса в котором зависит само существование жизни и смерти.\n\nКак одного из величайших защитников Азерота, вас наделили способностью пребывать в этом мире, не теряя своей телесной оболочки. Теперь вам предстоит раскрыть заговор, грозящий уничтожением Вселенной, и помочь легендарным героям всех эпох Warcraft вернуться в Азерот... или окончательно покинуть этот мир.";
	L.TIER_DATA[10].lore = "Драконы Азерота откликнулись на зов и вернулись, чтобы защитить свою родину, Драконьи острова. Магия стихий и энергия жизни Азерота наполняют вновь пробудившиеся Драконьи острова, и теперь вам предстоит исследовать их первобытные чудеса и раскрыть давно забытые тайны.";
	L.TITLES_DESC = "Звания отслеживаются по всей учётной записи, однако, некоторые Ваши персонажи могут иметь звания, доступные только им.";
	L.SHARED_APPEARANCES_LABEL = "Общие Облики";
	L.SHARED_APPEARANCES_LABEL_DESC = "Предметы из данного списка - общие облики для предмета выше. Для Режима Уникальных Обликов, этот список может помочь Вам разобраться, почему определённый предмт отмечен как Получен или нет.";
	L.UNIQUE_APPEARANCE_LABEL = "Уникальный Облик";
	L.UNIQUE_APPEARANCE_LABEL_DESC = "Этот предмет имеет Уникальный Облик. Вы должны получить именно этот предмет для открытия Облика.";
	L.UPON_COMPLETION = "По выполнении";
	L.UPON_COMPLETION_DESC = "Задания выше должны быть выполнены прежде, чем Вы сможете выполнить штучки, указанные ниже.";
	L.QUEST_CHAIN_REQ = "Требования для Цепочки Заданий";
	L.QUEST_CHAIN_REQ_DESC = "Следующие задания должны быть выполнены прежде, чем Вы сможете выполнить финальное задание.";
	L.AH_SEARCH_NO_ITEMS_FOUND = "Не найдено кэшированных предметов в поиске. Расширьте группу и осмотрите предметы для кэширования имен, и попробуйте снова. Только Персональные при Надевании предметы будут найдены при использовании данного поиска.";
	L.AH_SEARCH_BOE_ONLY = "Только Персональные при Надевании предметы будут найдены при использовании данного поиска.";
	L.TSM_WARNING_1 = "Использование данной команды может сломать Ваши существующие настройки TSM при перераспределении предметов к ";
	L.TSM_WARNING_2 = " группе.\n\nМы рекомендуем, чтобы Вы использовали другой профиль для данной функции.\n\nХотите продолжить в любом случае?";
	L.PRESET_UPDATE_SUCCESS = "Группа обновлена успешно.";
	L.SHOPPING_OP_MISSING_1 = "Группе не назначена операция 'Закупки'.";
	L.SHOPPING_OP_MISSING_2 = "Введине '/tsm operations', чтобы создать или назначить оную.";
	L.AUCTIONATOR_GROUPS = "Поиск по группам доступен только при использовании Auctionator.";
	L.TSM4_ERROR = "TSM4 пока что не совместим с ATT. Если Вы знаете, как создавать Группы, как мы делали это в TSM3, пожалуйста, свяжитесь с Crieve в Дискорде!";
	L.QUEST_MAY_BE_REMOVED = "Ошибка при получении информации. Это задание, возможно, удалено из игры. ";
	L.MINUMUM_STANDING = "Требуется отношение не менее, чем";
	L._WITH_ = " с ";
	L.MAXIMUM_STANDING = "Требуется отношение менее, чем";
	L.MIN_MAX_STANDING = "Требуется отношение между";
	L.AND_ = "И ";
	L._AND = " и";
	L._MORE = " ещё";
	L._OTHER_SOURCES = " другие источники";
	L.DURING_WQ_ONLY = "Может быть выполнено, когда локальное задание активно.";
	L.COMPLETED_DAILY = "Может быть выполнено ежедневно.";
	L.COMPLETED_WEEKLY = "Может быть выполнено еженедельно.";
	L.COMPLETED_MONTHLY = "Может быть выполнено ежемесячно.";
	L.COMPLETED_YEARLY = "Может быть выполнено ежегодно.";
	L.COMPLETED_MULTIPLE = "Может быть выполнено несколько раз.";
	L.CRITERIA_FOR = "Критерий для";
	L.CURRENCY_FOR = "Валюта для";
	L.LOOT_TABLE_CHANCE = "Общий шанс получения";
	L.BEST_BONUS_ROLL_CHANCE = "Наилучший шанс бонусного броска";
	L.BEST_PERSONAL_LOOT_CHANCE = "Наилучший шанс Персональной добычи";
	L.BONUS_ROLL = "Бонусный бросок";
	L.PREREQUISITE_QUESTS = "Есть предшествующие задания, которые должны быть выполнены перед получением:";
	L.BREADCRUMBS = "Задания-\"хлебные крохи\"";
	L.BREADCRUMBS_WARNING = "Есть задания-\"хлебные крохи\", которые могут быть недоступны после выполнения:";
	L.THIS_IS_BREADCRUMB = "Это задание-\"хлебная кроха\".";
	L.BREADCRUMB_PARTYSYNC = "Может быть недоступно для выполнения без Синхронизации группы, если выполнить любое из этих заданий:";
	L.BREADCRUMB_PARTYSYNC_2 = "Есть шанс получить при помощи Синхронизации группы с другим персонажем, который не выполнил ни одно из этих заданий:";
	L.BREADCRUMB_PARTYSYNC_3 = "Есть шанс получить при помощи Синхронизации группы с персонажем, который может принять это задание.";
	L.BREADCRUMB_PARTYSYNC_4 = "Пожалуйста, расскажите на нашем сервере Discord, смогли ли Вы получить это Задание при помощи Синхронизации группы!";
	L.DISABLE_PARTYSYNC = "Скорее всего это Задание невозможно выполнить на данном персонаже даже с Синхронизацией группы. Если Вам всё же удастся, пожалуйста, сообщите нам в Discord!";
	L.UNAVAILABLE_WARNING_FORMAT = "|c%s Становится недоступным, если %d из следующих выполнены:|r";
	L.NO_ENTRIES = "Не найдено ничего, что бы соответствовало вашим фильтрам.";
	L.NO_ENTRIES_DESC = "Если Вы уверены, что это была ошибка, попробуйте включить 'Режим Отладки'. Один из Ваших фильтов может ограничивать видимость группы.";
	L.DEBUG_LOGIN = "Награда за вход в игру.\n\nОтличная работа! ВЫ СДЕЛАЛИ ЭТО!\n\nОтображается только в Режиме Отладки.";
	L.UNSORTED_1 = "Несортированные";
	L.UNSORTED_2 = " (Несортированные)";
	L.UNSORTED_DESC = "Эти данные ещё не были добавлены в ATT.";
	L.NEVER_IMPLEMENTED = "Никогда Не Добавлены";
	L.NEVER_IMPLEMENTED_DESC = "Предметы технически существуют в игре, но никогда не были доступны игрокам";
	L.HIDDEN_QUEST_TRIGGERS = "Скрытые Триггеры Заданий";
	L.HIDDEN_QUEST_TRIGGERS_DESC = "Эти Задания, которые срабатывают основываясь на определённых критериях, в основном используются внутри игры в целях отслеживания";
	L.UNSORTED_DESC_2 = "Эти предметы существуют в игре и могут быть доступны игрокам, но ещё не были отсортированы в корректную секцию в ATT";
	L.BOUNTY_DESC = "Этот список содержит Недоступные предметы, что Дискорд ATT сообщил как ошибки, которые Blizzard ещё не исправили.\n\nВНИМАНИЕ: Все фильтры игнорируются в данном списке для видимости. Только предметы, удалённые из игры из-за халатности, но не из-за гигантского огнедышащего дракона, перечислены в данном списке.\n\nК разработчикам Blizzard: Пожалуйста, почините предметы и события, перечисленные ниже.";
	L.OPEN_AUTOMATICALLY = "Открывается автоматически";
	L.OPEN_AUTOMATICALLY_DESC = "Если Вы не разработчик Blizzard, то может быть хорошей идей отключить эту функцию. Это было сделано для того, чтобы заставить Blizzard исправить и/или признать данные баги.";
	L.TWO_CLOAKS = "|cffFF0000Эти два плаща имеют крайне ограниченные подтверждения о получении, если таковые имеются, поэтому считаются сломанными!|r";
	L.OGOM_THE_MANGLER_DESC = "|cffFF0000Огом Уничтожитель появляется только при выполнении ежедневного задания 'Штурм осадного лагеря Железной Орды'. Данное задание не было доступно со старта Легиона, а приобретаемое в гарнизоне задание 'Донесение: Штурм осадного лагеря Железной Орды' тоже не помогает.|r";
	L.DIFF_COMPLETED_1 = "Вы собрали всё из данной сложности. Переключитесь на ";
	L.DIFF_COMPLETED_2 = " взамен.";
	L.MINI_LIST = "Мини Список";
	L.MINI_LIST_DESC = "Этот список содержит важную информацию для текущей зоны, которая не может быть найдена в базе данных ATT";
	L.UPDATE_LOCATION_NOW = "Обновить Зону Сейчас";
	L.UPDATE_LOCATION_NOW_DESC = "Если Вы хотите принудительно обновить данные Вашей текущей Карты, нажмите эту кнопку!";
	L.PERSONAL_LOOT_DESC = "Каждый игрок имеет независимый шанс получить предмет, полезный для его класса...\n\n... Или хлам типа колец.\n\nКликните дважды, чтобы создать группу автоматически, если Вы сами по себе.";
	L.RAID_ASSISTANT = "Рейдовый Помощник";
	L.RAID_ASSISTANT_DESC = "Больше никогда не заходите в подземелье с неправильными настройками! Проверяйте, всё ли так, как нужно!";
	L.LOOT_SPEC_UNKNOWN = "Неизвестная Специализация для добычи";
	L.LOOT_SPEC = "Специализация для добычи";
	L.LOOT_SPEC_DESC = "В подземельях, рейдах и событиях в открытом мире с Персональной добычей, данная опция будет диктовать, какие предметы Вам доступны.\n\nНажмите эту строку, чтобы изменить!";
	L.DUNGEON_DIFF = "Сложность Подземелий";
	L.DUNGEON_DIFF_DESC = "Настройка сложности для подземелий.\n\nНажмите эту строку, чтобы изменить!";
	L.RAID_DIFF = "Сложность Рейдов";
	L.RAID_DIFF_DESC = "Настройка сложности для рейдов.\n\nНажмите эту строку, чтобы изменить!";
	L.LEGACY_RAID_DIFF = "Сложность Старинных Рейдов";
	L.LEGACY_RAID_DIFF_DESC = "Настройка сложности для старинных рейдов.\n\nНажмите эту строку, чтобы изменить!";
	L.TELEPORT_TO_FROM_DUNGEON = "Телепортировать в/из Подземелья";
	L.TELEPORT_TO_FROM_DUNGEON_DESC = "Нажмите здесь, чтобы телепортировать в/из Вашего текущего подземелья.\n\nВы можете использовать Сценарии Пандарии, чтобы таким образом быстро телепортироваться из текущего подземелья.";
	L.RESET_INSTANCES = "Обновление подземелий";
	L.RESET_INSTANCES_DESC = "Нажмите здесь, чтобы обновить Ваши подземелья.\n\n"..ALT_KEY_TEXT.." клик для переключения автоматического обновления Ваших подземелий, когда Вы выходите из них.\n\nПРЕДУПРЕЖДЕНИЕ: БУДЬТЕ ОСТОРОЖНЫ С ЭТИМ!";
	L.DELIST_GROUP = "Отписать Группу";
	L.DELIST_GROUP_DESC = "Нажмите здесь, чтобы отписать группу. Если Вы сами по себе, то покинете группу без телепортации Вас из подземелья.";
	L.LEAVE_GROUP = "Покинуть Группу";
	L.LEAVE_GROUP_DESC = "Нажмите здесь, чтобы покинуть группу. В большинстве случаев, Вас также телепортирует к ближайшему кладбищу через 60 секунд.\n\nВНИМАНИЕ: Работает только, если Вы в группе или игра считает, что Вы в группе.";
	L.LOOT_SPEC_DESC_2 = "В подземельях, рейдах и событиях в открытом мире с Персональной добычей, данная опция будет диктовать, какие предметы Вам доступны.\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.CURRENT_SPEC = "Текущая Специализация";
	L.CURRENT_SPEC_DESC = "Если Вы меняете Вашу Специализацию, Ваша Специализация для добычи меняется вместе с Вами.";
	L.DUNGEON_DIFF_DESC_2 = "Данная настройка позволяет изменять сложность подземелья.\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.CLICK_TO_CHANGE = "Нажмите, чтобы изменить. (Если доступно)";
	L.RAID_DIFF_DESC_2 = "Данная настройка позволяет изменять сложность рейда.\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.LEGACY_RAID_DIFF_DESC_2 = "Данная настройка позволяет изменять сложность старинного рейда. (До Осады Оргримара)\n\nНажмите эту строку, чтобы вернуться к Рейдовому Помощнику.";
	L.REROLL = "Повторный бросок";
	L.REROLL_DESC = "Нажмите эту кнопку, чтобы сделать повторный бросок, используя активный фильтр.";
	L.APPLY_SEARCH_FILTER = "Применить Фильтр для Поиска";
	L.APPLY_SEARCH_FILTER_DESC = "Пожалуйста, выберите фильтр для поиска.";
	L.SEARCH_EVERYTHING_BUTTON_OF_DOOM = "Нажмите эту Кнопку для поиска... ВСЕГО.";
	L.ACHIEVEMENT_DESC = "Нажмите эту кнопку для выбора случайного достижения, основываясь на том, какие у Вас отсутствуют.";
	L.ITEM_DESC = "Нажмите эту кнопку для выбора случайного предмета, основываясь на том, какие у Вас отсутствуют.";
	L.INSTANCE_DESC = "Нажмите эту кнопку для выбора случайного подземелья, включая сценарии, основываясь на несобранных Штучках.";
	L.DUNGEON_DESC = "Нажмите эту кнопку для выбора случайного подземелья, основываясь на несобранных Штучках.";
	L.RAID_DESC = "Нажмите эту кнопку для выбора случайного рейда, основываясь на несобранных Штучках.";
	L.MOUNT_DESC = "Нажмите эту кнопку для выбора случайного транспорта, основываясь на том, какие у Вас отсутствуют.";
	L.PET_DESC = "Нажмите эту кнопку для выбора случайного питомца, основываясь на том, какие у Вас отсутствуют.";
	L.QUEST_DESC = "Нажмите эту кнопку для выбора случайного задания, основываясь на несобранных Штучках.";
	L.TOY_DESC = "Нажмите эту кнопку для выбора случайной игрушки, основываясь на том, какие у Вас отсутствуют.";
	L.ZONE_DESC = "Нажмите эту кнопку для выбора случайной локации, основываясь на несобранных Штучках.";
	L.GO_GO_RANDOM = "Случайная цель - Получи Их!";
	L.GO_GO_RANDOM_DESC = "Данное окно позволит Вам выбрать случайный предмет или место для выполнения. Получи их!";
	L.CHANGE_SEARCH_FILTER = "Изменение Фильтра для Поиска";
	L.CHANGE_SEARCH_FILTER_DESC = "Нажмите, чтобы изменить фильтр для поиска.";
	L.REROLL_2 = "Повторный бросок: ";
	L.NOTHING_TO_SELECT_FROM = "Не из чего делать случайный выбор. Если включена опция 'Обновлять только видимые окна', то предварительно нужно открыть Основной Список (/att).";
	L.NO_SEARCH_METHOD = "Не выбран метод для поиска.";
	L.PROFESSION_LIST = "Список Профессий";
	L.PROFESSION_LIST_DESC = "Откройте Ваши профессии для кэширования.";
	L.CACHED_RECIPES_1 = "Кэшировано ";
	L.CACHED_RECIPES_2 = " известных рецептов!";
	L.WORLD_QUESTS_DESC = "Эти Локальные Задания и другие ограниченные по времени Штучки сейчас доступны где-либо. Получи их!";
	L.QUESTS_DESC = "Все задания в игре в порядке возрастания номеров.";
	L.UPDATE_WORLD_QUESTS = "Обновить Локальные Задания";
	L.UPDATE_WORLD_QUESTS_DESC = "Иногда API Локальных Заданий медленный или не может получить новые данные. Если Вы хотите принудительно обновить данные без смены локации, нажмите на кнопку!\n\n"..ALT_KEY_TEXT.." клик, чтобы добавить Штучки, которые могут быть не ограниченной доступности.";
	L.CLEAR_WORLD_QUESTS = "Очистить Локальные Задания";
	L.CLEAR_WORLD_QUESTS_DESC = "Нажмите, чтобы очистить текущую информацию в окне Локальных Заданий";
	L.ALL_THE_ITEMS_FOR_ACHIEVEMENTS_DESC = "Все предметы, что могут быть использованы для получения достижений, которые у Вас отсутствуют.";
	L.ALL_THE_APPEARANCES_DESC = "Все облики, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_MOUNTS_DESC = "Все средства передвижения, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_BATTLEPETS_DESC = "Все боевые питомцы, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_QUESTS_DESC = "Все задания, которые начинаются объектом или предметом, что можно купить на аукционе, отображаются здесь.";
	L.ALL_THE_RECIPES_DESC = "Все рецепты, что Вы ещё не получили, отображаются здесь.";
	L.ALL_THE_ILLUSIONS_DESC = "Все иллюзии, игрушки и другие предметы, что могут помочь пополнить коллекцию, отображаются здесь.";
	L.ALL_THE_REAGENTS_DESC = "Все предметы, что могут быть использованы в создании предмета на Вашем аккаунте.";
	L.AH_SCAN_SUCCESSFUL_1 = ": Успешно сканировано ";
	L.AH_SCAN_SUCCESSFUL_2 = " предмет(ов).";
	L.REAGENT_CACHE_OUT_OF_DATE = "Кэш реагентов устарел и будет обновлен, когда откроете Ваши профессии!";
	L.ARTIFACT_CACHE_OUT_OF_DATE = "Кэш Артефактов устарел и будет обновлен, когда перелогинитесь!";
	L.QUEST_LOOP = "Скорее всего ATT вырвался из цепочки зацикленных заданий.";
	L.QUEST_PREVENTS_BREADCRUMB_COLLECTION_FORMAT = "Задание '%s' %s не позволит собрать Хлебную Кроху '%s' %s";
	L.QUEST_OBJECTIVE_INVALID = "Недействительная Цель Задания";
	L.REFRESHING_COLLECTION = "Обновление коллекции...";
	L.DONE_REFRESHING = "Коллекция обновлена.";
	L.ADHOC_UNIQUE_COLLECTED_INFO = "Этот Предмет сломан в ATT из-за отсутствующей информации от Blizzard. Можно поправить, если вручную обновить коллекцию (Shift+Клик на окне ATT).";
	L.REQUIRES_PVP = "|CFF00FFDEЭта Штучка требует участия в ПвП или ПвП валюту.|r";
	L.REQUIRES_PETBATTLES = "|CFF00FFDEЭта Штучка требует игру с Боевыми Питомцами.|r";
	L.REPORT_INACCURATE_QUEST = "Неверная Информация о Задании! (Нажмите для Отчёта)";
	L.NESTED_QUEST_REQUIREMENTS = "Вложенные Требования Заданий";
	L.MAIN_LIST_REQUIRES_REFRESH = "[Откройте Основной список, чтобы обновить прогресс]";
	L.DOES_NOT_CONTRIBUTE_TO_PROGRESS = "|cffe08207Эта группа и её содержимое не влияют на прогресс данного окна, так как у этой Штучки уже указан Источник в другом месте!|r";
	L.CURRENCY_NEEDED_TO_BUY = "Примерно необходимо для покупки Не Собранных Штучек";
	L.LOCK_CRITERIA_LEVEL_LABEL = "Уровень Игрока";
	L.LOCK_CRITERIA_QUEST_LABEL = "Выполненное Задание";
	L.LOCK_CRITERIA_SPELL_LABEL = "Выученный Навык/Транспорт/Рецепт";
	L.LOCK_CRITERIA_FACTION_LABEL = "Репутация";
	L.LOCK_CRITERIA_FACTION_FORMAT = "%s с %s (Текущее: %s)";
	L.FORCE_REFRESH_REQUIRED = "Может потребоваться Полное Обновление коллекции ("..SHIFT_KEY_TEXT.." клик).";
	L.FUTURE_UNOBTAINABLE = "Будущие Недоступные!";
	L.FUTURE_UNOBTAINABLE_TOOLTIP = "Это контент, который точно или очень вероятно будет недоступен в будущем патче.";
	L.TRADING_POST = "Торговая лавка";

	-- Item Filter Window
		L.ITEM_FILTER_TEXT = "Фильтровать предметы";
		L.ITEM_FILTER_DESCRIPTION = "Вы можете отфильтровать предметы в ATT при помощи фильтра.";
		L.ITEM_FILTER_BUTTON_TEXT = "Задать фильтр";
		L.ITEM_FILTER_BUTTON_DESCRIPTION = "Нажмите, чтобы поменять фильтр.";
		L.ITEM_FILTER_POPUP_TEXT = "Какой фильтр Вы хотите задать для поиска?";

-- Instructional Text
	L.MINIMAP_MOUSEOVER_TEXT = "Правый клик - Меню Настроек.\nЛевый клик - Основной список.\n"..CTRL_KEY_TEXT.." клик - открыть Мини список.\n"..SHIFT_KEY_TEXT.." клик - Обновить Коллекцию.";
	L.TOP_ROW_INSTRUCTIONS = "|cff3399ffЗажатая Левая кнопка - Перемещение\nПравый клик - Меню Настроек\n"..SHIFT_KEY_TEXT.." клик - Обновить Коллекцию\n"..CTRL_KEY_TEXT.." клик - Свернуть/Развернуть Рекурсивно\n"..SHIFT_KEY_TEXT.." правый клик - Отсортировать список|r";
	L.OTHER_ROW_INSTRUCTIONS = "|cff3399ffКлик - Свернуть/Развернуть\nПравый клик - Открыть Мини список\n"..SHIFT_KEY_TEXT.." клик - Обновить Коллекцию\n"..CTRL_KEY_TEXT.." клик - Свернуть/Развернуть Рекурсивно\n"..SHIFT_KEY_TEXT.." правый клик - Отсортировать список\n"..ALT_KEY_TEXT.." правый клик - Расставить Указатели|r";
	L.TOP_ROW_INSTRUCTIONS_AH = "|cff3399ffЗажатая Левая кнопка - Перемещение\nПравый клик - Меню Настроек\n"..SHIFT_KEY_TEXT.." + Левый Клик - Поиск на Аукционе|r";
	L.OTHER_ROW_INSTRUCTIONS_AH = "|cff3399ffКлик - Свернуть/Развернуть\nПравый клик - Открыть Мини список\n"..SHIFT_KEY_TEXT.." клик - Поиск на Аукционе|r";
	L.RECENTLY_MADE_OBTAINABLE = "|CFFFF0000Если это недавно выпало для Вас (везде, кроме Утиля/Ящиков), пожалуйста, напишите в Discord, где Вы получили предмет!|r";
	L.RECENTLY_MADE_OBTAINABLE_PT2 = "|CFFFF0000Чем больше информации, тем лучше. Спасибо!|r";
	L.TOP_ROW_TO_LOCK = "|cff3399ff"..ALT_KEY_TEXT.." клик - Закрепить это Окно";
	L.TOP_ROW_TO_UNLOCK = "|cffcf0000"..ALT_KEY_TEXT.." клик - Открепить это Окно";
	L.QUEST_ROW_INSTRUCTIONS = "Правый клик - Открыть Цепочку Заданий";
	L.SYM_ROW_INFORMATION = "Правый клик - Показать дополнительный контент из других источников";
	L.QUEST_ONCE_PER_ACCOUNT = "Один-Раз-На-Аккаунт Задание";
	L.QUEST_ONCE_PER_ACCOUNT_FORMAT = "Выполнено На: %s";

-- Settings.lua
	L.SKIP_AUTO_REFRESH = "Не авто обновлять при изменении настроек!";	-- Skip Settings-Toggle Data Refreshes!
	L.SKIP_AUTO_REFRESH_TOOLTIP = "По умолчанию (выключено) любое изменение Настроек, которое меняет отображаемую информацию, будет авто обновлять коллекцию.\n\nПосле включения этой опции, изменения Настроек не будут менять отображение, пока Вы не произведёте Полное Обновление коллекции, сделав "..SHIFT_KEY_TEXT.." клик на окне ATT.";
	L.AFTER_REFRESH = "После Обновления";

	-- General tab
		-- Mode Title
			L.MODE = "Режим";
			L.TITLE_COMPLETIONIST = "Коллекционер ";
			L.TITLE_UNIQUE_APPEARANCE = "Уникальный ";
			L.TITLE_DEBUG = app.ccColors.Red .. "Отладка|R ";
			L.TITLE_ACCOUNT = app.ccColors.Account.."Учётная Запись|R ";
			L.TITLE_MAIN_ONLY = " (Основной Персонаж)";
			L.TITLE_NONE_THINGS = "Без Штучек ";
			L.TITLE_ONLY = "";
			L.TITLE_INSANE = app.ccColors.Insane.."Безумный|R ";
			L.TITLE_SOME_THINGS = "Некоторые Штучки ";
			L.TITLE_LEVEL = "Уровень ";
			L.TITLE_SOLO = "Соло ";
			L._BETA_LABEL = " |cff4AA7FF[Бета]|R";

		--TODO: L.GENERAL_CONTENT = "General Content";
		L.MERCH_BUTTON_LABEL = "Мерч";
		L.TWITCH_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на мой канал Twitch.\n\nВы можете задавать вопросы, когда трансляция онлайн, и я постараюсь на них ответить!\n\nПримечание переводчика: на английском языке.";
		L.DISCORD_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на Discord сервер All The Things.\n\nВы можете делиться своим прогрессом или фрустрацией с другими собирателями!\n\nПримечание переводчика: на английском языке.";
		L.PATREON_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на Patreon All The Things.\n\nТам вы можете поддержать аддон финансово!";
		L.MERCH_BUTTON_TOOLTIP = "Нажмите, чтобы скопировать ссылку на магазин мерчендайза All The Things.\n\nТам вы можете поддержать аддон финансово и получить за это крутой мерч!";
		L.MODE_EXPLAIN_LABEL = "|cffFFFFFFЗдесь кратко изложено то, что Вы собираете. Включите все "..app.ccColors.Insane.."цветные параметры|cffFFFFFF, чтобы разблокировать "..app.ccColors.Insane.."Безумный Режим|cffFFFFFF.";	-- "|cffFFFFFFWhat you collect is summarized as a specific Mode. Enable all " .. app.ccColors.Insane .. "colored options|cffFFFFFF to unlock ".. app.ccColors.Insane .. "Insane Mode|cffFFFFFF.";
		L.DEBUG_MODE = app.ccColors.Red.."Режим Отладки|r (Показать Всё)";
		L.DEBUG_MODE_TOOLTIP = "Буквально... ВСЕ ШТУКИ В ИГРЕ. ОКОНЧАТЕЛЬНО. ТОЧКА. АГА, ВСЕ ОНИ. Даже Несобираемые штуки, как сумки, расходуемые, реагенты и прочие, появятся в списках. (Даже Вы сами! Нет, серьёзно. Смотрите.)\n\nДанный режим только для отладки. Не предназначен для отслеживания выполнения.\n\nЭтот режим игнорирует все фильтры, включая Несобираемые.";
		L.COMPLETIONIST_MODE = "+Источники";
		L.COMPLETIONIST_MODE_TOOLTIP = "Включите данный режим, чтобы считать все Предметы Собранными только тогда, когда определённый Предмет был открыт для данного Облика.\n\nЭто означает, что Вы должны получить каждый общий Облик для Предмета.\n\nПримечание: По умолчанию, игра перестаёт сообщать Вам о Предметах, которые Вы собрали после получения общего Источника, поэтому данный режим позволит отслеживать несобранные Предметы.";
		L.I_ONLY_CARE_ABOUT_MY_MAIN = "Только основной персонаж";
		L.MAIN_ONLY_MODE_TOOLTIP = "Включите данную функцию, если Вы также хотите ATT *притворяться*, что Вы собрали все общие облики, непривязанные к определённому классу или расе.\n\nНапример, если Вы собрали набор Охотника из ЦЛК, и у него есть общие облики без ограничения по классу/расе, ATT *притворится*, что Вы также собрали этот источник облика.\n\nПримечание: Переключение на другую расу/класс некорректно сообщит, что Вы собрали источники обликов, которые на самом деле не собраны для этого персонажа.";
		L.ACCOUNT_MODE = app.ccColors.Account.."Режим Аккаунта";
		L.ACCOUNT_MODE_TOOLTIP = "Включите данную настройку, если Вы хотите отслеживать Штучки для всех Ваших персонажей, независимо от фильтров расы и класса.\n\nФильтры Недоступных по-прежнему применяются.";
		L.FACTION_MODE = "Только Фракция";
		L.FACTION_MODE_TOOLTIP = "Включите данную настройку, если Вы хотите отслеживать Штучки в Режиме Аккаунта только для рас и классов Вашей текущей фракции.";
		L.PRECISION_SLIDER = "Уровень точности";
		L.PRECISION_SLIDER_TOOLTIP = 'Используйте для установления желаемой точности для процентных рассчётов.\n\nПо умолчанию: 2';
		L.MINIMAP_SLIDER = "Размер Кнопки Миникарты";
		L.MINIMAP_SLIDER_TOOLTIP = 'Используйте для установления желаемого размера Кнопки Миникарты.\n\nПо умолчанию: 36';
		L.ACCOUNT_THINGS_LABEL = "Штучки для всего аккаунта";
		L.GENERAL_THINGS_LABEL = "Общие Штучки";
		L.EXPANSION_THINGS_LABEL = "Штучки Дополнений";
		--TODO: L.EXTRA_THINGS_LABEL = "Additional Resources";
		L.STRANGER_THINGS_LABEL = "Дополнительные Штучки";
		L.ACHIEVEMENTS_CHECKBOX_TOOLTIP = "Включите для отслеживания достижений.";
		L.TMOG_CHECKBOX_TOOLTIP = "Включите для отслеживания получения обликов.\n\nПримечание: Отключение данной опции также отключит все фанфары и рассчёты о получении. Вы можете отключить для избежания лагов во время занятия важным групповым контентом, но держите в уме, что рассчёты будут произведены при обратном включении.\n\n"..ACC_WIDE_DEFAULT;
		L.AZERITE_ESSENCES_CHECKBOX_TOOLTIP = "Включите для отслеживания Азеритовых Сущностей.\n\nПо умолчанию отслеживается на каждом персонаже отдельно.";
		L.BATTLE_PETS_CHECKBOX_TOOLTIP = "Включите для отслеживания боевых питомцев и спутников. Могут быть обнаружены в открытом мире или в качестве добычи с боссов в различных Подземельях или Рейдах, равно как у торговцев и различных фракций.\n\n"..ACC_WIDE_DEFAULT;
		L.FLIGHT_PATHS_CHECKBOX = app.ccColors.Insane .. "Полёты & Паромные Станции";
		L.FLIGHT_PATHS_CHECKBOX_TOOLTIP = "Включите для отслеживания путей полётов и паромных станций.\n\nЧтобы *собрать* их, начните разговор с распорядителем полётов/паромной станции на каждом континенте.\n\nПримечание: Из-за технологии фазирования, Вам может потребоваться перейти в другую версию локации, чтобы засчитать эти достопримечательности.";
		L.FOLLOWERS_CHECKBOX_TOOLTIP = "Включите для отслеживания соратников и чемпионов.\n\nТо есть: Соратники в Гарнизоне, Чемпионы Оплота Класса в Легионе, Спутники Битвы за Азерот, а также Спутники из Тёмных Земель.";
		L.HEIRLOOMS_CHECKBOX_TOOLTIP = "Включите для отслеживания разблокирования Наследства и его соответствующих Уровней Улучшения.\n\nНаследство, которое ассоциируется с Облком, фильтруется фильтром Обликов. (отключение обликов всё также отобразит Наследство)\n\nНекоторые предметы, имеющие качество Наследства, также помогают улучшать репутации и могут быть отфильтрованы фильтром Репутации.\n\n"..ACC_WIDE_DEFAULT;
		L.HEIRLOOMS_UPGRADES_CHECKBOX = app.ccColors.Insane .. "+Улучшения";
		L.HEIRLOOMS_UPGRADES_CHECKBOX_TOOLTIP = "Включите для отслеживания индивидуальных улучшений для Наследства.\n\nМы все знаем, что Blizzard любит высасывать Ваше золото и душу, так что следите за ними с данным переключателем.";
		L.ILLUSIONS_CHECKBOX = app.ccColors.Insane..WEAPON_ENCHANTMENT;
		L.ILLUSIONS_CHECKBOX_TOOLTIP = "Включите для отслеживания чар для оружия.\n\nЭто круто выглядящие эффекты, которые можно применить к Вашему оружию!\n\nПримечание: Вы не иллюзия, невзирая на то, как считают все Ночнорождённые.\n\n"..ACC_WIDE_DEFAULT;
		L.MOUNTS_CHECKBOX_TOOLTIP = "Включите для отслеживания транспорта.\n\nВы можете ездить на них, чтобы перемещаться из точки А в точку Б быстрее, чем бегом. Кто бы мог подумать!\n\n"..ACC_WIDE_DEFAULT;
		L.MUSIC_ROLLS_SELFIE_FILTERS_CHECKBOX = "|T"..app.asset("Expansion_WOD")..":0|t " .. app.ccColors.Insane .. "Мелодии & Фильтры селфи";
		L.MUSIC_ROLLS_SELFIE_FILTERS_CHECKBOX_TOOLTIP = "Включите для отслеживания мелодий и фильтров селфи.\n\nВы можете использовать игрушку Переносной музыкальный проигрыватель, чтобы воспроизводить внутриигровую музыку, и Камеру СЕЛФИ 2.0, чтобы собирать селфи для фотографий в определённых местах!";
		L.QUESTS_CHECKBOX_TOOLTIP = "Включите для отслеживания обычных Заданий.\n\nПри помощи правого клика на любое задание в списках Вы можете открыть полную цепочку заданий, чтобы отобразить Ваш прогресс и любые предшествующие Задания.\n\nПримечание: Задания не отслеживаются перманентно из-за природы отслеживания Ежедневных, Еженедельных, Ежегодных и Локальных заданий в базе данных Blizzard.";
		L.QUESTS_LOCKED_CHECKBOX = app.ccColors.Insane.."+Ограниченные";
		L.QUESTS_LOCKED_CHECKBOX_TOOLTIP = "Включите для специального отслеживания выполнения Ограниченных Заданий.\n\nОграниченные Задания - это те, которые игрок не может выполнить (исходя из известных ATT данных) при обычной игре.\n\nПолучение этих Заданий полагается на Синхронизацию группы или отслеживание заданий для Всего Аккаунта";
		L.RECIPES_CHECKBOX_TOOLTIP = "Включите для отслеживания рецептов для Ваших профессий\n\nПримечание: Вы должны открыть Ваши профессии, чтобы кэшировать известные рецепты.";
		L.REPUTATIONS_CHECKBOX = app.ccColors.Insane .. "Репутации";
		L.REPUTATIONS_CHECKBOX_TOOLTIP = "Включите для отслеживания репутаций.\n\nПосле достижения Превознесения или статуса Лучший друг, будет отмечено как Собрано.\n\nМожет потребоваться ручное обновление коллекции, чтобы засчитать их корректно.";
		L.RUNEFORGELEGENDARIES_CHECKBOX = "|T"..app.asset("Expansion_SL")..":0|t "..app.ccColors.Insane.."Легендарки ТЗ";
		L.RUNEFORGELEGENDARIES_CHECKBOX_TOOLTIP = "Включите для отслеживания Легендарных предметов Тёмных Земель.";
		L.DRAKEWATCHERMANUSCRIPTS_CHECKBOX_TOOLTIP = "Включите для отслеживания Манускриптов наблюдений за драконами "..EXPANSION_NAME9;
		L.SOULBINDCONDUITS_CHECKBOX_TOOLTIP = "Включите для отслеживания Проводников Медиумов.";
		L.TITLES_CHECKBOX_TOOLTIP = "Включите для отслеживания званий.\n\nОни выделяют Вашего персонажа и показывают, как давно Вы играете. Обычно только у новых игроков нет выбранного звания.";
		L.TOYS_CHECKBOX_TOOLTIP = "Включите для отслеживания игрушек.\n\nБольшинство из них имеют забавные эффекты. Другие же, как игрушечные Камни возвращения, могут быть использованы вместо обычного Камня возвращения и сохранить Вам место в сумке! Они также имеют интересные эффекты... Здорово!\n\n"..ACC_WIDE_DEFAULT;
		L.MINIMAP_BUTTON_CHECKBOX = "Показывать Кнопку у Миникарты";
		L.MINIMAP_BUTTON_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите кнопку у миникарты. Эта кнопка позволяет Вам быстро открыть Основной список, показать Ваш общий прогресс и открыть Меню Настроек по Правому Клику.\n\nНекоторые люди не любят захламленность. Альтернативно, Вы можете открыть Основной список командой '/att' в чате. Оттуда Правым Кликом по заголовку открыть Меню Настроек.";
		L.MINIMAP_BUTTON_STYLE_CHECKBOX = "Использовать Старую Кнопку";
		L.MINIMAP_BUTTON_STYLE_CHECKBOX_TOOLTIP = "Некоторым людям не нравится новая кнопочка...\n\nОни ошибаются!\n\nЕсли Вам она не нравится, вот Вам опция, чтобы использовать старую.";
		L.SHOW_COMPLETED_GROUPS_CHECKBOX = "Показать Выполненные Группы";
		L.SHOW_COMPLETED_GROUPS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть выполненные группы как заголовок с процентом выполнения. Если группа не имеет ничего важного для Вашего класса, эта настройка также отобразит такие группы в списке.\n\nМы рекомендуем Вам отключить эту настройку, поскольку будет занимать место в Мини списке и мешать быстро определить, что доступно в текущей зоне.";
		L.SHOW_COLLECTED_THINGS_CHECKBOX = "Показать Собранные Штучки";
		L.SHOW_COLLECTED_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, чтобы видеть Штучки, которые уже были Собраны.\n\nМы рекомендуем Вам отключить эту настройку, поскольку будет занимать место в Мини списке и мешать быстро определить, что доступно в текущей зоне.";
		L.SHOW_INCOMPLETE_THINGS_CHECKBOX = "Все Отслеживаемые Штучки";
		L.SHOW_INCOMPLETE_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть все предметы, объекты, НИПов и заголовки, которые могут отслеживаться внутри игры и не обязательно считаться 'собираемыми'.\n\nВы можете использовать эту функцию для помощи в выполнении достижения Хранитель Мудрости, если Вы ещё не получили его.\n\nПримечание: Редкие или Виньетки также появляются в списках при включении этой настройки.";
		L.SHOW_REPEATABLE_THINGS_CHECKBOX = "Собирать Повторяемые Задания";
		L.SHOW_REPEATABLE_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите считать ежедневные, еженедельные и ежегодные задание как собираемые. Они также появятся в списках как обычные задания.\n\nПримечание: НЕ предназначено для использования всё время, но если Вы выполняете набор дейликов в локации, которую завершили, и хотите вспомнить, где что находится, Вы можете использовать данную функцию.";
		L.FIRST_TIME_CHECKBOX = "Только первый раз";
		L.FIRST_TIME_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите считать повторяемые ежедневные, еженедельные, ежегодные и локальные задания собранными, если Вы выполнили их хотя бы один раз, игнорируя прежде выполненное задание, которое было обновлено.\n\nПримечание: Прежде выполненное повторяемое задание сохраняется только тогда, когда Вы выполнили его со включенным аддоном, и эти данные будут потеряны, если будут удалены данные аддона из папки WTF.";
		L.FILTER_THINGS_BY_LEVEL_CHECKBOX = app.ccColors.Insane.."Без Фильтра по Уровню";
		L.FILTER_THINGS_BY_LEVEL_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть контент, который может быть недоступен Вам по уровню.\n\nПримечание: Особенно полезно выключать на пробных учётных записях.";
		L.SHOW_BOE_CHECKBOX = app.ccColors.Insane.."БоЕ/БоА Предметы";
		L.SHOW_BOE_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите отслеживать Персональные при Надевании/Привязанные к аккаунту предметы.\n\nПолезно выключить, когда Вы пытаетесь закончить Классические Подземелья для персонажа и не хотите специально фармить предметы, которые могут быть получены на альтах или Аукционе.\n\nТо есть: Не лишитесь рассудка во время гринда Маятника Рока.";
		L.SHOW_PVP_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите отслеживать весь контент, который 'может' требовать ПвП.";
		--TODO: L.SHOW_ALL_SEASONAL = app.ccColors.Insane .. "All Seasonal Events";
		--TODO: L.SHOW_ALL_SEASONAL_TOOLTIP = "Enable this setting to show all seasonal events, instead of only currently active seasonal events.";
		L.SHOW_PET_BATTLES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите отслеживать весь контент, который требует Битвы Питомцев.";
		L.IGNORE_FILTERS_FOR_BOES_CHECKBOX = "Игнорировать Фильтры БоЕ/БоА";
		L.IGNORE_FILTERS_FOR_BOES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите игнорировать требования по типу брони, оружия, расе, классу или профессии для БоЕ/БоА предметов.\n\nЕсли Вы стремитесь собрать штучки для Ваших альтов через Аукцион, этот режим может быть полезен для Вас.";
		L.EXPAND_DIFFICULTY_CHECKBOX = "Развернуть Текущую Сложность";
		L.EXPAND_DIFFICULTY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите автоматически минимизировать заголовки в мини списке, которые не активны, когда Вы входите в подземелье или рейд.\n\nПример: Минимизировать Героический заголовок, когда в Обычной сложности подземелья.";
		L.WARN_DIFFICULTY_CHECKBOX = "Предупреждать о\nВыполненной Сложности";
		L.WARN_DIFFICULTY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите получать предупреждение, когда заходите в подземелье со сложностью, в которой Вы не сможете получить никаких новых штучек, когда есть альтернативная несохранённая сложность, в которую Вы можете пойти заместо текущей.";
		L.REPORT_COLLECTED_THINGS_CHECKBOX = "Сообщать о Собранных Штучках";
		L.REPORT_COLLECTED_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть сообщение в чате, объясняющее, какие предметы Вы получили или удалили из коллекции.\n\nПримечание: Эта настройка присутствует потому, что Blizzard бесшумно добавляет облики и другие собираемые предметы и не считает нужным оповещать Вас о дополнительных предметах, доступных Вам.\n\nМы рекомендуем оставить эту опцию включенной. Вы будете всё также слышать фанфары, если отключите её, если они включены.";
		L.REPORT_COMPLETED_QUESTS_CHECKBOX = "Сообщать о Заданиях";
		L.REPORT_COMPLETED_QUESTS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть QuestID для каждого задания, которое Вы приняли или выполнили. (Для сообщения об ошибках, для отслеживания и т.п)";
		L.REPORT_UNSORTED_CHECKBOX = "Только 'Без Источника'";
		L.REPORT_UNSORTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть QuestID задания, только если у него обозначен Источник.";
		L.BEHAVIOR_LABEL = "Настройки Списков";
		L.DYNAMIC_CATEGORY_LABEL = "Динамические Категории";
		L.DYNAMIC_CATEGORY_OFF_TOOLTIP = "Не генерировать Динамические Категории.";
		L.DYNAMIC_CATEGORY_SIMPLE = "Простые";
		L.DYNAMIC_CATEGORY_SIMPLE_TOOLTIP = "Генерировать Динамические Категории только на основе самой общей Категории.";
		L.DYNAMIC_CATEGORY_NESTED = "Вложенные";
		L.DYNAMIC_CATEGORY_NESTED_TOOLTIP = "Генерировать Динамические Категории на основе точного Источника. Это приводит к повторам Штучек, которые имеют несколько Источников.";
		L.DYNAMIC_CATEGORY_TOOLTIP_NOTE = "\n\n|cffff0000Требует Перезагрузки интерфейса|r";
		L.CLICK_TO_CREATE_FORMAT = "Нажмите, чтобы создать %s";
		L.LOADING_FORMAT = "%s загружаются...";
		L.READY_FORMAT = "%s загрузились";
		--TODO: L.KEYBINDINGS_TEXT = "You can set keybindings for ATT in the game's options.";

	-- Account-Wide Checkboxes
		L.ACCOUNT_WIDE_ACHIEVEMENTS_TOOLTIP = TRACK_ACC_WIDE.."\n\nДостижения обычно отслеживаются на всю учётную запись, но есть некоторые эксклюзивные для определённых классов или рас достижения, которые Вы не сможете получить на основном персонаже.";
		L.ACCOUNT_WIDE_AZERITE_ESSENCES_TOOLTIP = TRACK_ACC_WIDE.."\n\nАзеритовые Сущности технически не могут быть собраны и использованы на всю учётную запись, но если Вам важно только собрать их на основном персонаже, то Вам предпочтительнее отслеживать их на всю учётную запись.";
		L.ACCOUNT_WIDE_FLIGHT_PATHS_TOOLTIP = TRACK_ACC_WIDE.."\n\nОтслеживание Путей Полётов отдельное на каждого персонажа, но Вы действительно хотите собирать их на всех Ваших 50 персонажах?";
		L.ACCOUNT_WIDE_FOLLOWERS_TOOLTIP = TRACK_ACC_WIDE.."\n\nСпутники обычно считаются по персонажу, но Вы же не хотите собирать 243 спутника в Таверне Гарнизона по одному в неделю?\n\nОчень сомневаюсь.";
		L.ACCOUNT_WIDE_MUSIC_ROLLS_SELFIE_FILTERS_TOOLTIP = TRACK_ACC_WIDE.."\n\nМузыкальные ролики и селфи-фильтры обычно не отслеживаются в базе данных Blizzard, но мы можем это сделать.\n\nПРИМЕЧАНИЕ. Вы можете воспроизводить музыкальные композиции только с помощью игрушки «Музыкальный автомат» или делать селфи с помощью игрушечной камеры S.E.L.F.I.E, которую Вы собрали для текущего персонажа.";
		L.ACCOUNT_WIDE_QUESTS_TOOLTIP = TRACK_ACC_WIDE.."\n\nВыполнение заданий чаще всего считается отдельно для каждого персонажа, но с этой настройкой будет засчитываться, если хоть один персонаж выполнил задание.";
		L.ACCOUNT_WIDE_RECIPES_TOOLTIP = TRACK_ACC_WIDE.."\n\nРецепты не отслеживаются на всю учётную запись в базе данных Blizzard, но мы можем делать это сами.\n\nНевозможно собрать их все на одном персонаже, поэтому Вы можете придать значение профессиям своих альтов.";
		L.ACCOUNT_WIDE_REPUTATIONS_TOOLTIP = TRACK_ACC_WIDE.."\n\nРепутации теперь отслеживаются на всю учётную запись для достижений в базе данных Blizzard, так что включение этой опции может быть хорошей идеей.";
		L.ACCOUNT_WIDE_SOULBINDCONDUITS_TOOLTIP = TRACK_ACC_WIDE.."\n\nВключите, чтобы считать Проводники Медиумов собранными, если хотя бы один персонаж имеет к ним доступ.";
		L.ACCOUNT_WIDE_TITLES_TOOLTIP = TRACK_ACC_WIDE.."\n\nБольшинство званий отслеживается на всю учётную запись, но некоторые престижные звания в WoW закреплены за персонажем, получившим их.\n\nПереключите эту опцию, если они Вам не важны, и Вы хотите видеть эти звания Собранными на Ваших альтах.";

	-- Filters tab
		L.ITEM_EXPLAIN_LABEL = "|cffFFFFFFЭти предметы всегда видимы в "..app.ccColors.Account.."Режиме Аккаунта|cffFFFFFF.|r";
		L.CLASS_DEFAULTS_BUTTON = "Классовые";
		L.CLASS_DEFAULTS_BUTTON_TOOLTIP = "Нажмите на эту кнопку, чтобы сбросить все фильтры к стандартным для Вашего класса.\n\nПримечание: Только фильтры, которые могут быть собраны Вашим классом, будут включены.";
		L.ALL_BUTTON_TOOLTIP = "Нажмите на эту кнопку, чтобы включить все фильтры сразу.";
		L.UNCHECK_ALL_BUTTON_TOOLTIP = "Нажмите на эту кнопку, чтобы отключить все фильтры.";
		--TODO: L.CUSTOM_FILTERS_LABEL = "Automated Content";
		L.CUSTOM_FILTERS_EXPLAIN_LABEL = "|CFFFFFFFFЭти Штучки всегда показываются, если они доступны текущему персонажу или в "..app.ccColors.Account.."Режиме Аккаунта|cffFFFFFF.|r";
		L.CUSTOM_FILTERS_GENERIC_TOOLTIP_FORMAT = "Включите данную настройку, чтобы всегда показывать %s, даже если это недоступно на данном персонаже.";

	-- Unobtainables tab
		L.UNOBTAINABLES_TAB = "Недоступные";
		L.SEASONAL_LABEL = "Сезонные";
		L.SEASONAL_ALL = "|cffECBC21Переключить Все Сезонные";
		--TODO: L.UNOBTAINABLE_LABEL = "Unobtainable Content";
		L.UNOBTAINABLE_ALL = "|cffECBC21Переключить Все Недоступные";
		L.NO_CHANCE_ALL = "|cffECBC21Переключить Все \"Без Шансов\"";
		L.HIGH_CHANCE_ALL = "|cffECBC21Переключить Все \"Высокий Шанс\"";

	-- Interface tab
		L.TOOLTIP_LABEL = "Подсказки";
		L.ENABLE_TOOLTIP_INFORMATION_CHECKBOX = "Интеграция Подсказок";
		L.ENABLE_TOOLTIP_INFORMATION_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть информацию ATT во всплывающих подсказках. Включает в себя подсказки в ссылках на предметов от других игроков, предметы на аукционе, в путеводителе по приключениям, в Ваших сумках, в мире, над НИПами и т.п.\n\nЕсли Вы выключите данную функцию, Вы серьёзно снизите Вашу возможность быстро определить, нужно ли убить моба или изучить данный облик.\n\nМы рекомендуем оставить эту опцию включённой.";
		L.DISPLAY_IN_COMBAT_CHECKBOX = "В Бою";
		L.DISPLAY_IN_COMBAT_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите показывать информацию в подсказках во время боя.\n\nЕсли Вы рейдите с Вашей Эпохальной/Эпохальной+ гильдией, Вы, возможно, должны отключить эту настройку, чтобы снизить нагрузку на систему.\n\nОпция может быть полезна, когда Вы проходите старый контент, чтобы сразу знать, что Вам нужно с босса.";
		L.TOOLTIP_MOD_LABEL = "Модификатор";
		L.TOOLTIP_SHOW_LABEL = "Отображаемая Информация";
		L.SHOW_COLLECTION_PROGRESS_CHECKBOX = "Прогресс Коллекции";
		L.SHOW_COLLECTION_PROGRESS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Ваш прогресс к получению Штучки или завершении группы Штучек в Правом Верхнем углу подсказки.\n\nМы рекомендуем оставить эту опцию включенной.";
		L.ICON_ONLY_CHECKBOX = "Только Иконка";
		L.ICON_ONLY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть только иконку в углу подсказки вместо иконки и надписи собрано/не собрано.\n\nНекоторым людям нравятся подсказки поменьше...";
		L.COORDINATES_CHECKBOX = "Координаты";
		L.COORDINATES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть координаты в подсказке, когда наводите на элементы в мини списке.";
		L.DESCRIPTIONS_CHECKBOX = "Описания";
		L.DESCRIPTIONS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть описания в подсказках. Может включать дополнительное описание, добавленное одним из авторов аддона, который решил, что дополнительная информация будет необходимой.\n\nВозможно, Вы захотите оставить опцию включенной.";
		L.LORE_CHECKBOX = "Лор";
		L.LORE_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть лор в подсказках. Может включать текст из Путеводителя по подземельям или описание от авторов аддона.";
		L.KNOWN_BY_CHECKBOX = "Изучено";
		L.KNOWN_BY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке полный список персонажей на всех серверах, которые изучили данный рецепт.";
		L.COMPLETED_BY_CHECKBOX = "Выполнено";
		L.COMPLETED_BY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке полный список персонажей на всех серверах, которые выполнили данное Задание.";
		L.SHOW_MODELS_CHECKBOX = "Предпоказ";
		L.SHOW_MODELS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке модель вместо иконки.\n\nДанная настройка может помочь идентифицировать Редкого монстра или Торговца по внешнему виду. Возможно, Вы захотите оставить опцию включенной по этой причине.";
		L.SHOW_CURRENCY_CALCULATIONS_CHECKBOX = "Рассчет покупок";
		L.SHOW_CURRENCY_CALCULATIONS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке приблизительное количество Предметов/Валюты, необходимое для покупки Штучек.\n\nДля Контейнеров, которые не гарантируют получение всего содержимого за раз, оценка затрат будет ниже.";
		L.SHARED_APPEARANCES_CHECKBOX = "Общие Облики";
		L.SHARED_APPEARANCES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке предметы, которые имеют общий облик.\n\nПримечание: Предметы, которые не совпадают по типу брони отображаются в списке для того, чтобы определить прогресс Коллекции.\n\nЕсли Вы путаетесь в них, начиная с ATT v1.5.0, Вы можете Правым Кликом по предмету \"открыть\" предмет и его собственный Мини Список со всеми Общими Обликами.";
		L.INCLUDE_ORIGINAL_CHECKBOX = "Оригинал";
		L.INCLUDE_ORIGINAL_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вам нравится видеть в подсказке оригинальный источник среди списка Общих Обликов.";
		L.ONLY_RELEVANT_CHECKBOX = "Только Уместные";
		L.ONLY_RELEVANT_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть только те общие облики, которые Ваш персонаж может открыть.\n\nПримечание: Мы рекомендуем оставить эту опцию выключенной, поскольку знание требований для разблокирования может быть полезным для понимания, почему предмет считается Не Собранным.";
		L.PROFESSION_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке требуемые профессии.";
		L.LEVELREQ_CHECKBOX = "Уровни";
		L.LEVELREQ_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке требования к уровню.";
		L.CLASSES_CHECKBOX = "Классы";
		L.CLASSES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть полный список требований по классу в подсказке.";
		L.RACES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть полный список требований по расе в подсказке.";
		L.SPEC_CHECKBOX = "Специализации";
		L.SPEC_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке информацию о специализации для добычи предмета, выданную Игровым Клиентом.\n\nПримечание: Эти иконки будут отображаться в мини списках ATT независимо от этой настройки.";
		L.SUMMARIZE_CHECKBOX = "Суммировать Штучки";
		L.SUMMARIZE_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите суммировать Штучки в подсказках. Например, если Штучка может быть отдана Торговцу для другой Штучки, тогда в подсказке покажется эта вторая Штучка для отображения её различных использований. Если Штучка служит Контейнером для других Штучек, то эта опция покажет все другие Штучки, что этот контейнер содержит.\n\nМы рекомендуем оставить эту опцию включённой.";
		L.CONTAINS_SLIDER_TOOLTIP = 'Используйте для изменения числа суммирующихся Штучек для отображения в подсказке.\n\nПо умолчанию: 25';
		L.SOURCE_LOCATIONS_CHECKBOX = "Местонахождение\nИсточников";
		L.SOURCE_LOCATIONS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть в подсказке полную информацию о Местонахождении Источников для объектов в базе данных ATT.";
		L.LOCATIONS_SLIDER_TOOLTIP = 'Используйте для изменения количества локаций источников для отображения в подсказке.\n\nПримечание: Также будет показывать количество других источников, основываясь на том сколько их, если же общее число равно общему числу отображаемых элементов, то просто покажет последний источник.\n\nПо умолчанию: 5';
		L.COMPLETED_SOURCES_CHECKBOX = "Для Собранных";
		L.COMPLETED_SOURCES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть местонахождение выполненных источников в подсказке.\n\nНапример, если Вы выполнили задание \"Батранов волос\" в Ясеневом Лесу, подсказка для Орендила Широколиста больше не будет показывать это задание.";
		L.DROP_CHANCES_CHECKBOX = "Шанс Выпадения";
		L.DROP_CHANCES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть шанс выпадения в подсказке.\nМожет быть полезно для выбора специализации при Бонусном Броске.";
		L.FOR_CREATURES_CHECKBOX = "Для Существ";
		L.FOR_CREATURES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Местонахождение Источников для Существ.";
		L.FOR_THINGS_CHECKBOX = "Для Штучек";
		L.FOR_THINGS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Местонахождение Источников для Штучек.";
		L.FOR_UNSORTED_CHECKBOX = "Для Несортированного";
		L.FOR_UNSORTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Местонахождение Источников, которые не были полностью отсортированы в базе данных.";
		L.WITH_WRAPPING_CHECKBOX = "Сокращение";
		L.WITH_WRAPPING_CHECKBOX_TOOLTIP = "Включите данную опцию, чтобы сокращать строки в подсказках.\nЭта функция будет контролировать ширину подсказки, чтобы не увеличилась слишком сильно, но она также сократит читаемость источников в большинстве случаев.";
		L.SHOW_REMAINING_CHECKBOX = "Показать Оставшиеся Штучки";
		L.SHOW_REMAINING_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите количество оставшися предметов вместо прогресса и общего числа.";
		L.PERCENTAGES_CHECKBOX = "Показать Процент Завершения";
		L.PERCENTAGES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть процент завершения в каждом ряду.\n\nНе влияет на окрашивание групп.";
		L.MORE_COLORS_CHECKBOX = "Использовать Цвета";
		L.MORE_COLORS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть больше использованных цветов, помогающих различать дополнительные условия для Штучек в списках (то есть цвета классов, фракций и т.п.)";
		L.TOOLTIP_HELP_CHECKBOX = "Показать Помощь в Подсказке";
		L.TOOLTIP_HELP_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть вспомогательную информацию в подсказке над окнами ATT, показывающую различные комбинации клавиш для управления.\nЕсли Вы уже знаете все комбинации, вполне резонно отключить их, чтобы уменьшить размер подсказок.";
		L.MAIN_LIST_SLIDER_LABEL = "Масштаб Основого Списка";
		L.MAIN_LIST_SCALE_TOOLTIP = 'Используйте для изменения масштаба Основного Списка.\n\nПо умолчанию: 1';
		L.MINI_LIST_SLIDER_LABEL = "Масштаб Мини Списков";
		L.MINI_LIST_SCALE_TOOLTIP = 'Используйте для изменения масштаба Мини и Других Списков.\n\nПо умолчанию: 1';
		L.ADDITIONAL_LABEL = "Дополнительная Информация";
		--TODO: L.WINDOW_COLORS = "Window Colors";
		--TODO: L.BACKGROUND_TOOLTIP = "Set the background color of all ATT windows.";
		--TODO: L.BORDER_TOOLTIP = "Set the border color of all ATT windows.";
		--TODO: L.RESET_TOOLTIP = "Reset the background and border color of all ATT windows.";
		--TODO: L.CLASS_BORDER = "Use Class Color For Border";
		--TODO: L.CLASS_BORDER_TOOLTIP = "Use your class color for the borders. This updates when you log onto another class.";

	-- Features tab
		L.MINIMAP_LABEL = "Кнопка у Миникарты";
		L.MODULES_LABEL = "Модули и Мини Списки";
		L.REPORTING_LABEL = "Сообщения";
		L.ADHOC_UPDATES_CHECKBOX = "Обновлять только видимые окна";
		L.ADHOC_UPDATES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите обновлять только открытые окна ATT.\n\nЭта опция может серьёзно ускорить загрузку и предотвратить фризы в некоторых ситуациях.";
		L.SKIP_CUTSCENES_CHECKBOX = "Авто Пропуск Сцен";
		L.SKIP_CUTSCENES_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматичски пропускал все внутриигровые сцены.";
		L.AUTO_BOUNTY_CHECKBOX = "Авто Открывать Список Пропаж";
		L.AUTO_BOUNTY_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал список предметов, которые считаются крайне важными для нахождения. Если у Вас получится стащить один из перечисленных здесь предметов, Вы можете сделать получить хорошую сумку золотых.\n\nБыстрая Команда: /attbounty";
		L.AUTO_MAIN_LIST_CHECKBOX = "Авто Открывать Основной Список";
		L.AUTO_MAIN_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал Основной Список при входе в игру.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Основной Список\n\nБыстрая Команда: /att";
		L.AUTO_MINI_LIST_CHECKBOX = "Авто Открывать Мини Список";
		L.AUTO_MINI_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть всё, что можно собрать в текущей локации. Этот список будет автоматически изменяться при смене зоны. Некоторым людям не нравится данная особенность, но когда Вы играете соло, данная опция крайне полезна.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Мини Список\n\nБыстрая Команда: /att mini";
		L.AUTO_PROF_LIST_CHECKBOX = "Авто Открывать Список Профессии";
		L.AUTO_PROF_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал и обновлял список профессии, когда Вы открываете Ваши профессии. Из-за навязанных ограничений API, аддоны могут взаимодействовать с профессиями только, когда они открыты. Этот список будет автоматически переключаться, когда Вы открываете другую профессию.\n\nМы не рекомедуем отключать данную опцию, поскольку она может предотватить некорректное отслеживание рецептов.\n\nВы также можете назначить клавишу для данной настройки (работает только при открытой профессии):\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Список Профессии";
		L.AUTO_RAID_ASSISTANT_CHECKBOX = "Авто Открывать Рейдового Помощника";
		L.AUTO_RAID_ASSISTANT_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал альтернативное окно для управления настройками группы/рейда под названием 'Рейдовый Помощник'. Список автоматически обновляется, когда настройки группы меняются.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Рейдового Помощника\n\nБыстрая Команда: /attra";
		L.AUTO_WQ_LIST_CHECKBOX = "Авто Открывать Локальные Задания";
		L.AUTO_WQ_LIST_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT автоматически открывал Список 'Локальных Заданий'. Этот список автоматически обновляется, когда Вы меняете локацию.\n\nВы также можете назначить клавишу для данной настройки:\n\nНазначение Клавиш -> Модификации -> ALL THE THINGS -> Переключить Локальные Задания\n\nБыстрая Команда: /attwq";
		L.CURRENCIES_IN_WQ_CHECKBOX = "Считать Валюту собираемой";
		L.CURRENCIES_IN_WQ_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите считать валюту/предметы, которые можно использовать для получения собираемых Штучек, тоже считать собираемыми в наградах Заданий.";
		L.AUCTION_TAB_CHECKBOX = "Показать Модуль Ауциона";
		L.AUCTION_TAB_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите видеть Модуль Аукциона ATT.\n\nНекоторые модификации - плохие ребята, и значительно изменяют это окно. ATT не всегда хорошо играет с такими игрушками.";
		L.SORT_BY_PROGRESS_CHECKBOX = "Сортировать по Прогрессу";
		L.SORT_BY_PROGRESS_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы операция 'Сортирования' ("..SHIFT_KEY_TEXT.." правый клик) сортировала по общему прогрессу каждой группы (вместо 'по имени').";
		L.QUEST_CHAIN_NESTED_CHECKBOX = "Вложенные Требования Заданий";
		L.QUEST_CHAIN_NESTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы окно Требования Цепочек Заданий (Правый Клик по Заданию) показывало требующиеся Задания как подгруппы их последующих заданий, то есть они должны быть выполнены изнутри наружу.\n\nЭто полезно, чтобы не пропустить Хлебные Крохи, и должно быть использовано по большей части для завершения Заданий как цель.\n\nВ противном случае, Требования Цепочек Заданий будет отображаться списком сверху-вниз, с самым ранним доступным Заданием на самом верху.";
		L.CELEBRATIONS_LABEL = "Поздравления и Звуковые Эффекты";
		--TODO: L.AUDIO_CHANNEL = "Audio Channel";
		L.CELEBRATE_COLLECTED_CHECKBOX = "Собранная Штучка заслуживает Поздравления";
		L.CELEBRATE_COLLECTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите слышать фанфары, когда Вы получаете новую Штучку.\n\nДанная опция сильно помогает сохранять мотивацию.";
		L.WARN_REMOVED_CHECKBOX = "Убранная Штучка вызывает Предупреждение";
		L.WARN_REMOVED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите слышать предупреждающий звуковой эффект, когда Вы случайно продаёте обратно или передаёте предмет, который добавил Вам облик, который Вы потеряете из своей коллекции.\n\nМожет быть крайне полезно, если Вы продаёте торговцу предмет с таймером возврата. Аддон скажет Вам, что совершаете ошибку.";
		L.SCREENSHOT_COLLECTED_CHECKBOX = "Собранная Штучка заслуживает Скриншота";
		L.SCREENSHOT_COLLECTED_CHECKBOX_TOOLTIP = "Включите данную опцию, если Вы хотите делать скриншот, когда Вы получаете новую Штучку.";
		--TODO: L.ICON_LEGEND_LABEL = "Icon Legend";
		--TODO: L.ICON_LEGEND_TEXT = app.ccColors.White .. "|TInterface\\AddOns\\AllTheThings\\assets\\status-unobtainable.blp:0|t " .. "Unobtainable" .. "\n|TInterface\\AddOns\\AllTheThings\\assets\\status-prerequisites.blp:0|t " .. "Obtainable only with prerequisites" .. "\n|TInterface\\AddOns\\AllTheThings\\assets\\status-seasonal-unavailable.blp:0|t " .. "Seasonal content" .. "\n|TInterface\\FriendsFrame\\StatusIcon-Offline:0|t " .. "Unavailable on current character";
		L.CHAT_COMMANDS_LABEL = "Команды Чата";
		L.CHAT_COMMANDS_TEXT = "/att |cffFFFFFFили|R /things |cffFFFFFFиои|R /allthethings\n|cffFFFFFFОткрыть Главный Список.\n\n|R/att mini |cffFFFFFFиои|R /attmini\n|cffFFFFFFОткрыть Мини Список.\n\n|R/att bounty\n|cffFFFFFFОткрыть список забагованных или неподтверждённых предметов.\n\n|R/att ra |cffFFFFFFили|R /attra\n|cffFFFFFFОткрыть Рейдовый Помощник.\n\n|R/att wq |cffFFFFFFили|R /attwq\n|cffFFFFFFОткрыть Список Локальных Заданий.\n\n|R/att item:1234 |cffFFFFFFили|R /att [Ссылка на Предмет]\n|cffFFFFFFОткрыть окно общих моделей. Также работает с другими Штучками, например, |R quest:1234|cffFFFFFF, |Rnpcid:1234|cffFFFFFF, |Rmapid:1234|cffFFFFFF или |Rrecipeid:1234|cffFFFFFF.\n\n|R/att rwp\n|cffFFFFFFПоказать все Штучки, которые будет невозможно получить в будущем.\n\n|R/att random |cffFFFFFFили|R /attrandom |cffFFFFFFили|R /attran\n|cffFFFFFFОткрыть Случайный Список.\n\n|R/att unsorted\n|cffFFFFFFОткрыть список несортированных Штучек. Лучше в Режиме Отладки.\n\n|R/rl\n|cffFFFFFFПерезагрузить интерфейс WoW.|R";

	-- Profiles tab
		L.PROFILES_PAGE = "Профили";
		L.PROFILE = "Профиль";
		L.PROFILE_INITIALIZE = "Инициализировать Профили";
		L.PROFILE_INITIALIZE_TOOLTIP = "Включить поддержку Профилей. Ваши текущие Настройки и позиции окон будут скопированы в Профиль '"..DEFAULT.."', который нельзя будет удалить, но можно будет отредактировать, и который будет использован как начальный Профиль на всех персонажах.\n\nПожалуйста, сообщайте обо всех ошибках и необычном поведении Профилей на сервере ATT Discord!";
		L.PROFILE_INITIALIZE_CONFIRM = "Вы уверены, что хотите включить поддержку Профилей?";
		L.PROFILE_NEW_TOOLTIP = "Создать пустой Профиль для использования текущим персонажем";
		L.PROFILE_COPY_TOOLTIP = "Скопировать Выделенный Профиль в Текущий Профиль";
		L.PROFILE_DELETE_TOOLTIP = "Удалить Выделенный Профиль";
		L.PROFILE_SWITCH_TOOLTIP = "Установить Выделенный Профиль как Текущий Профиль\n\nИли кликните на Профиль с зажатым "..SHIFT_KEY_TEXT;
		L.SHOW_PROFILE_LOADED = "Показывать Текущий Профиль после загрузки и после смены Профиля";

	-- Sync tab
		L.SYNC_PAGE = "Синхронизация";
		L.ACCOUNT_SYNCHRONIZATION = "Сихронизация Аккаунтов";
		L.AUTO_SYNC_ACC_DATA_CHECKBOX = "Автоматически Синхронизировать Данные Аккаунтов";
		L.AUTO_SYNC_ACC_DATA_TOOLTIP = "Включите данную опцию, если Вы хотите, чтобы ATT пытался автоматически синхронизировать данные между учётными записями во время перезахода в игру или перезагрузки интерфейса.";
		L.ACCOUNT_MANAGEMENT = "Управление Аккаунтами";
		L.ACCOUNT_MANAGEMENT_TOOLTIP = "Данный список отображает весь функционал относительно синхронизации данных учётной записи.";
		L.ADD_LINKED_CHARACTER_ACCOUNT = "Прикрепить Персонажа / Аккаунт";
		L.ADD_LINKED_CHARACTER_ACCOUNT_TOOLTIP = "Нажмите, чтобы прикрепить персонажа или учётную запись к Вашей учётной записи.";
		L.ADD_LINKED_POPUP = "Пожалуйста, введите имя персонажа или учётную запись BNET для прикрепления.";
		L.SYNC_CHARACTERS_TOOLTIP = "Здесь отображаются все персонажи на Вашей учётной записи.";
		L.NO_CHARACTERS_FOUND = "Персонажей не найдено.";
		L.LINKED_ACCOUNTS = "Прикреплённые Аккаунты";
		L.LINKED_ACCOUNTS_TOOLTIP = "Здесь отображаются все прикреплённые учётные записи.";
		L.NO_LINKED_ACCOUNTS = "Прикреплённых аккаунтов не найдено.";
		L.LINKED_ACCOUNT_TOOLTIP = "Учётная запись данного персонажа будет автоматически синхронизироваться при входе в игру. Для оптимальной игры Вам лучше добавить персонажа-банкира, а не основного персонажа, чтобы процесс сихронизации не влиял на процесс игры на основном персонаже.";
		L.DELETE_LINKED_CHARACTER = "Правый Клик - Удалить этого Прикреплённого Персонажа";
		L.DELETE_LINKED_ACCOUNT = "Правый Клик - Удалить этот Прикреплённый Аккаунт";
		L.DELETE_CHARACTER = "Правый Клик - Удалить этого Персонажа";
		L.CONFIRM_DELETE = "\n \nВы точно хотите удалить это?";

	-- About tab
		L.ABOUT_PAGE = "Об аддоне";
		L.ABOUT_1 = " |CFFFFFFFF- модификация для отслеживания коллекции, которая показывает Вам где и как получить всё в игре! У нас большое сообщество в Discord (ссылка внизу), где Вы можете спрашивать, оставлять предложения, а также сообщать об ошибках и пропавших предметах. Если Вы нашли предмет или задание, которые не задокументированы, Вы можете сказать нам в Discord, для более технически подкованных у нас Git, в котором Вы можете участвовать.\n\nПока мы стремимся к выполнению, есть множество вещей, что добавляются в игру с каждым патчем, и если что-то отсутствует, пожалуйста, поймите, у нас небольшая команда, пытающаяся держать темп с изменениями, в то же время собирая Штучки. :D\n\nНе стесняйтесь спрашивать меня во время трансляций, даже если вопрос не связан напрямую с ATT (стандартное программирование аддонов WoW тоже).\nПримечание переводчика: на английском языке.\n\n- |r|Cffff8000Crieve|CFFFFFFFF\n\nPS: Зацените версию All The Things Classic и TBC Classic!\n\nНет, ATT не тот аддон, который ставит иконки в Ваших сумках. Это CanIMogIt и Caerdon Wardrobe!\n\nРекомендуем сайт для сравнения коллекций DataForAzeroth.com от shoogen!|r";
		L.ABOUT_2 = "Дополнительные Участники: |CFFFFFFFF(в произвольном порядке)\nDaktar, Lucetia, Slumber, Gold, Avella, Aiue, Dead Serious, Oiche, Oxlotus, Eiltherune, Blueyleader, Iyanden, Pr3vention, BigBlaris, Talonzor, Mogwai, Heallie, Eckhardt, Boohyaka, Sadidorf, Sanctuari, Molkree, Runawaynow, Braghe, Myrhial, Darkal, Tag и весь остальной ALL THE THINGS Discord!\n\nОсобая Благодарность AmiYuy (CanIMogIt) и Caerdon (Caerdon Wardrobe).|r";
		L.ABOUT_3 = "\n|CFFFFFFFFВы просто обязаны загрузить их аддоны для иконок коллекций в Ваших сумках!|r";

	-- Binding Localizations
		L.TOGGLE_ACCOUNT_MODE = "Переключить режим Аккаунта";
		L.TOGGLE_COMPLETIONIST_MODE = "Переключить режим Собирателя";
		L.TOGGLE_DEBUG_MODE = "Переключить режим Отладки";
		L.TOGGLE_FACTION_MODE = "Переключить режим Фракции";
		L.PREFERENCES = "Настройки";
		L.TOGGLE_COMPLETEDTHINGS = "Переключить Собранные Предметы (Все)";
		L.TOGGLE_COMPLETEDGROUPS = "Переключить Собранные Группы";
		L.TOGGLE_COLLECTEDTHINGS = "Переключить Собранные Предметы";
		L.TOGGLE_BOEITEMS = "Переключить БоЕ/БоА Предметы";
		L.TOGGLE_SOURCETEXT = "Переключить Расположение Источников";
		L.MODULES = "Модули";
		L.TOGGLE_MAINLIST = "Переключить Основной Список";
		L.TOGGLE_MINILIST = "Переключить Мини Список";
		L.TOGGLE_PROFESSION_LIST = "Переключить Список Профессии";
		L.TOGGLE_WORLD_QUESTS_LIST = "Переключить Локальные Задания";
		L.TOGGLE_RAID_ASSISTANT = "Переключить Рейдового Помощника";
		L.TOGGLE_RANDOM = "Переключить Рандомизатор";
		L.REROLL_RANDOM = "Повторный бросок Рандомизатора";

	-- Event Text
		L.ITEM_ID_ADDED = "%s (%d) добавлен в Вашу коллекцию.";
		L.ITEM_ID_ADDED_RANK = "%s (%d) [Ранг %d] добавлен в Вашу коллекцию.";
		L.ITEM_ID_ADDED_MISSING = "%s (%d) добавлен в Вашу коллекцию. Не найден в базе данных. Пожалуйста, сообщите в Discord ATT!";
		L.ITEM_ID_ADDED_SHARED = "%s (%d) [+%d] были добавлены в Вашу коллекцию.";
		L.ITEM_ID_ADDED_SHARED_MISSING = "%s (%d) [+%d] были добавлены в Вашу коллекцию. Не найдены в базе данных. Пожалуйста, сообщите в Discord ATT!";
		L.ITEM_ID_REMOVED = "%s (%d) был удален из Вашей коллекции.";
		L.ITEM_ID_REMOVED_SHARED = "%s (%d) [+%d] были удалены из Вашей коллекции.";

	-- Tooltip Text
		L.DROP_RATE = "Шанс Выпадения";
		L.QUEST_GIVER = "Начинает Задание";
		L.LOCKOUT = "Сохранение";
		L.SHARED = "Все Сложности";
		L.SPLIT = "Отдельные Сложности";
		L.REQUIRES_LEVEL = "Требуется Уровень";
		L.SECRETS_HEADER = "Секреты";
		L.LIMITED_QUANTITY = "Предмет имеется в ограниченном количестве и может не всегда быть доступен у торговца.";
		L.SOURCE_ID_MISSING = "Пожалуйста, сообщите в канале #retail-errors на нашем сервере Discord, где Вы нашли эту вещь!";
		L.ADDED_WITH_PATCH_FORMAT = "Это будет добавлено в патче %s";
		L.REMOVED_WITH_PATCH_FORMAT = "Это исчезнет в патче %s";

	-- Icons and Collection Text
		L.COLLECTED = "|T" .. app.asset("known") .. ":0|t |cff15abffСобрано|r";	-- Acquired the colors and icon from CanIMogIt.
		L.COLLECTED_APPEARANCE = "|T" .. app.asset("known_circle") .. ":0|t |cff15abffСобрано*|r";	-- Acquired the colors and icon from CanIMogIt.
		L.NOT_COLLECTED = "|T" .. app.asset("unknown") .. ":0|t |cffff9333Не Собрано|r";	-- Acquired the colors and icon from CanIMogIt.
		L.COMPLETE = "|T" .. app.asset("known_green") .. ":0|t |cff6dce47Выполнено|r";	-- Acquired the colors and icon from CanIMogIt.
		L.COMPLETE_OTHER = "|T" .. app.asset("known_green") .. ":0|t |cff6dce47Выполнено*|r";	-- Acquired the colors and icon from CanIMogIt.
		L.INCOMPLETE = "|T" .. app.asset("incomplete") .. ":0|t |cff15abffНе Выполнено|r";	-- Acquired the colors and icon from CanIMogIt.
		L.KNOWN_ON_CHARACTER = "|T" .. app.asset("known") .. ":0|t |cff15abffИзвестно на текущем персонаже|r";
		L.UNKNOWN_ON_CHARACTER = "|T" .. app.asset("unknown") .. ":0|t |cffff9333Неизвестно на текущем персонаже|r";
		L.COST_TEXT = "|T" .. app.asset("Currency") .. ":0|t |cff0891ffВалюта|r";

local a = L.ABBREVIATIONS;
for key,value in pairs({
	["Анторус, Пылающий Трон"] = "Анторус";	-- ["Antorus, the Burning Throne"] = "Antorus"
	["Expansion Pre"] = "Препатч";
	["Особый контент"] = "ОК";
	[GROUP_FINDER] = "П и Р";	-- ["Dungeons & Raids"] = "D&R"
	["Cataclysm"] = "Ката";
	["Темные Земли"] = "ТЗ",
	["Player vs Player"] = "ПвП";
	["Поиск рейда"] = "ЛФР";
	["Обычный"] = "О";
	["Героический"] = "Г";
	["Эпохальный"] = "Э";
	["Тайный рынок Тазавеш"] = "Тазавеш";	-- ["Tazavesh, the Veiled Market"] = "Tazavesh"
	["10 игроков"] = "10";
	["25 игроков"] = "25";
	["героич."] = "гер.";
	["Локальные задания"] = "ЛЗ",	-- ["World Quests"] = "WQ"
	["годовщина World of Warcraft"] = "годовщина";
	["Ковенант:"] = "Ков:",
})
do a[key] = value; end

L.CUSTOM_DIFFICULTIES[-1] = "Поиск Рейда (5.4)";
L.CUSTOM_DIFFICULTIES[-2] = "Гибкий (5.4)";
L.CUSTOM_DIFFICULTIES[-3] = "Обычный (5.4)";
L.CUSTOM_DIFFICULTIES[-4] = "Героический (5.4)";

local a = L.HEADER_NAMES;
for key,value in pairs({
	-- Garrison
		[-152] = "Гарнизонная кампания",							-- Garrison Campaign
	-- Other
		[-211] = "Новый персонаж",									-- New Character
	-- Fishing
		[-217] = "Наживки",											-- Lures (for Fishing)
	-- PvP
		[-242] = "Нерейтинговые",									-- Unrated
		[-243] = "Премия",											-- Bounty
	-- Allied Races
		[-254] = "Союзные расы",									-- Allied Races
		[-255] = "Традиционные доспехи",							-- Heritage
	-- Outposts in Draenor
		[-361] = "Артиллерийная башня",								-- Artillery Tower
	-- BFA Outposts
		[-397] = "Аванпосты",										-- Outposts
	-- 5.3
		[-398] = "Поле битвы: Степи",								-- Battlefield: Barrens
	-- BFA War Chest
		[-488] = "Трофейный сундук",								-- Daily War Chest
	-- Misc
		[-493] = "Сломанный лут с миссий",							-- Broken Mission Loot
	-- Blizzard Events and Anniversaries
		[-520] = "Препатч",											-- Expansion Pre-Launch
		[-543] = "Вторжение Легиона",								-- Legion Invasions
	-- Cataclysm PvP Seasons
		[-672] = select(2, GetAchievementInfo(6002))..": Сезон 9",	-- Vicious Gladiator: Season 9
		[-656] = "Доспехи Беспощадного гладиатора за очки чести",	-- Honor Gear Ruthless Season
		[-673] = select(2, GetAchievementInfo(6124))..": Сезон 10",	-- Ruthless Gladiator: Season 10
		[-654] = "Доспехи Гладиатора Катаклизма за очки чести",		-- Honor Gear Cataclysmic Season
		[-674] = select(2, GetAchievementInfo(6938))..": Сезон 11",	-- Cataclysmic Gladiator: Season 11
	-- Mists of Pandaria PvP Seasons
		[-675] = select(2, GetAchievementInfo(8214))..": Сезон 12",	-- Malevolent Gladiator: Season 12
		[-653] = "Доспехи Деспотичного гладиатора за очки чести",	-- Honor Gear Tyrannical Season
		[-676] = select(2, GetAchievementInfo(8791))..": Сезон 13",	-- Tyrannical Gladiator: Season 13
		[-652] = "Доспехи Бездушного гладиатора за очки чести",		-- Honor Gear Grievous Season
		[-651] = "Доспехи Гордого гладиатора за очки чести",		-- Honor Gear Prideful Season
	-- Pets
		[-795] = "Подземелья Боевых питомцев",						-- Pet Battle Dungeons
	-- Chests
		[-851] = "Тайник Темной Империи",							-- Black Empire Cache
	-- Shadowlands Header
		[-979] = "Брокер Ве'кен & Брокер Ве'нотт",					-- Broker Ve'ken & Broker Ve'nott
		[-924] = "Транспортная Сеть",								-- Transport Network
		-- SL Bastion/Kyrian
			[-973] = "Верность",									-- Loyalty
			[-975] = "Смирение",									-- Humility
		-- SL Revendreth/Venthyr
			[-954] = "Инквизиторы",									-- Inquisitors
			[-955] = "Старшие Инквизиторы",							-- High Inquisitors
			[-956] = "Великие Инквизиторы",							-- Grand Inquisitors
			[-967] = "Восстановление зеркала",						-- Mirror Restoration
			[-968] = "Набор A",										-- Set A
			[-969] = "Набор B",										-- Set B
			[-970] = "Набор C",										-- Set C
			[-971] = "Набор D",										-- Set D
	-- Dragonflight
		[-1100] = DRAKE_MANUSCRIPTS,								-- Drakewatcher Manuscripts
		[-1101] = "Изначальные Бури",								-- Primal Storms
		[-1102] = "Гневион и Сабеллиан",							-- Wrathion & Sabellian
		[-1120] = "Кентавры Маруук",								-- Maruuk Centaur
		[-1130] = "Искарские клыкарры",								-- Iskaara Tuskarr
		[-1143] = "Редкие DF по расписанию",						-- DF Rare Rotation
		[-1150] = "Лоаммские ниффы",								-- Loamm Niffen
		[-1151] = "Обмен",											-- Bartering
		[-1200] = "Зкерские хранилища",								-- Zskera Vaults
		[-1202] = "Налеты Фиракка",									-- Fyrakk Assaults
		[-1203] = "Нюхорысканье",									-- Sniffenseeking
	-- Tier/Dungeon/Event/Holiday Sets
		-- Artifact Strings
			[-5200] = "Основной облик",								-- Base Appearance
			[-5201] = "Кампания оплота",							-- Class Hall Campaign
			[-5202] = "Баланс Сил",									-- Balance of Power
			[-5203] = "Награды за Престиж",							-- Prestige Rewards
			[-5204] = "Облик Испытаний",							-- Challenge Appearance
			[-5205] = "Скрытый облик",								-- Hidden Appearance

	-- Classes
		[-9951] = GetSpellInfo(148462).." и "..GetSpellInfo(137031),	-- Discipline / Holy Priest Spec
		[-9952] = GetSpellInfo(234890).." и "..GetSpellInfo(137011),	-- Guardian / Feral Druid Spec
	------ ACHIEVEMENT HEADERS SECTION ------
		[-10071] = "Видения Н'Зота",								-- Visions of N'Zoth
		[-10072] = "Нападение Н'Зота",								-- N'Zoth Assault
		[-10081] = "Заражённая область",							-- Corrupted Area
		[-10082] = "Захваченная область",							-- Lost Area
})
do a[key] = value; end

-- Fall-back 'name' values for Quests based on QuestID
local a = L.QUEST_NAMES;
for key,value in pairs({
	-- [QuestID] = "Name",
})
do a[key] = value; end

-- Fall-back 'name' values for Items based on ItemID
local a = L.ITEM_NAMES;
for key,value in pairs({
	-- [ItemID] = "Name",
})
do a[key] = value; end

local a = L.UNOBTAINABLE_ITEM_REASONS;
for key,value in pairs({
	[1] = {1, "|CFFFF0000Никогда не был доступен игрокам.|r", "Никогда Не Доступны"}, -- No Hope
	[2] = {1, "|CFFFF0000Был убран из игры.|r", "Убраны Из Игры"}, -- No Hope
	[4] = {3, "|CFFFF0000Это больше нельзя будет купить или получить в коллекцию, если у вас нет необходимого PvP титула или если вы не входили в топ % лучших в этом сезоне.|r", "ПвП Элита / Гладиатор"},

	-- Arbitrary Filters
		[9] = {3, "|CFFFF0000Первоначальный источник получения был удален и теперь доступен только на аукционе черного рынка.|r", "Черный рынок AH [BMAH]"},
		[10] = {3, "|CFFFF0000Первоначально доступно через карту TCG, которая больше не печатается, но все еще может быть доступна на черном рынке, в игре или на аукционах в реальной жизни.|r", "Коллекционная карточная игра [TCG]"},
		[11] = {3, "|CFFFF0000Это больше не доступно, если вы не знаете кого-то, у кого есть доступ к предметам, используемым для вызова босса.|r", "Требуются предметы для призыва"},
		-- [13] = {1, "|CFFFF0000Ваши последователи слишком высокого уровня, и миссия для тайника больше не будет появляться.|r", "Устаревший тайник"},
		[15] = {1, "|CFFFF0000Это нельзя выучить навсегда или использовать для трансмогрификации.|r", "Неизучаемые"},
		[35] = {3, "|CFFFF0000Может быть скрыто за вложением денег, возможно, игровой магазин, другая игра Blizzard и \"Пригласи Друга\".|r", "Кошелек Blizzard"},
		-- [36] = {1, "|CFFFF0000Было доступно для получения только во время Годовщины WoW, и более не доступно.|r", "Годовщина WoW [Убрано]"},	--TODO: Remove.
		[38] = {1, "|CFFFF0000Это доступно только игрокам, которые выполнили цепочку квестов «Легендарный плащ» во время Mists of Pandaria или через BMAH.|r", "Ордос - Легендарный плащ"},
		-- #if BEFORE BFA
		-- [41] = {1, "|CFFFF0000Это доступно только игрокам, которые завершили соответствующие испытания артефактов Башни магов и получили базовый внешний вид.|r", "Появления в Башне Магов"},
		-- #endif
		[45] = {1, "|CFFFF0000Изменения добычи Blizzard сломали несколько предметов и сделали их недоступными. Накидка Дома Дворян / Теплый плащ Империи Гурубаши (обе награды Эмиссара BfA), Огом Манглер, награды с миссий WoD и некоторый лут с Героического Режима Ульдуара в настоящее время сломаны, и их необходимо починить.|r", "Сломанная добыча"},
})
do a[key] = value; end

local a = L.CUSTOM_COLLECTS_REASONS;
for key,value in pairs({
	["NPE"] = { icon = "|T"..("Interface\\Icons\\achievement_newplayerexperience")..":0|t", color = "ff5bc41d", text = "Новый Персонаж", desc = "Только Новый Персонаж может собрать эти предметы." },
	["SL_SKIP"] = { icon = "|T"..app.asset("Expansion_SL")..":0|t", color = "ff76879c", text = "Нити Судьбы", desc = "Только Персонаж, который пропустил сюжет Тёмных Земель, может собрать эти предметы." },
	["HOA"] = { icon = "|T"..("Interface\\Icons\\inv_heartofazeroth")..":0|t", color = "ffe6cc80", text = GetSpellInfo(275825), desc = "Только Персонаж с |cffe6cc80Сердцем Азерот|r может собрать эти предметы." },
	["!HOA"] = { icon = "|T"..("Interface\\Icons\\mystery_azerite_chest_normal")..":0|t", color = "ffe6cc80", text = "|cffff0000Без|r Сердца Азерот", desc = "Только Персонаж |cffff0000без|r |cffe6cc80Сердца Азерот|r может собрать эти предметы." },
})
do a[key] = value; end
